<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>文件系统</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                              <h2 id="&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;">&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h2>
<p>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x5C0F;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x7684;&#x4E00;&#x5957;&#x4EE5;&#x5C0F;&#x7A0B;&#x5E8F;&#x548C;&#x7528;&#x6237;&#x7EF4;&#x5EA6;&#x9694;&#x79BB;&#x7684;&#x5B58;&#x50A8;&#x4EE5;&#x53CA;&#x4E00;&#x5957;&#x76F8;&#x5E94;&#x7684;&#x7BA1;&#x7406;&#x63A5;&#x53E3;&#x3002;&#x901A;&#x8FC7; <a href="../../api/wx.getFileSystemManager.html">wx.getFileSystemManager()</a> &#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x5168;&#x5C40;&#x552F;&#x4E00;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x7BA1;&#x7406;&#x64CD;&#x4F5C;&#x901A;&#x8FC7; <a href="../../api/FileSystemManager.html">FileSystemManager</a> &#x6765;&#x8C03;&#x7528;&#x3002;</p>
<pre><code class="language-javascript"><span class="hljs-keyword">const</span> fs = wx.getFileSystemManager()
</code></pre>
<p>&#x6587;&#x4EF6;&#x4E3B;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;</p>
<ul>
<li>&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#xFF1A;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#x6307;&#x7684;&#x662F;&#x5728;&#x9879;&#x76EE;&#x76EE;&#x5F55;&#x4E2D;&#x6DFB;&#x52A0;&#x7684;&#x6587;&#x4EF6;&#x3002;</li>
<li>&#x672C;&#x5730;&#x6587;&#x4EF6;&#xFF1A;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#x672C;&#x5730;&#x4EA7;&#x751F;&#xFF0C;&#x6216;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#xFF0C;&#x5B58;&#x50A8;&#x5230;&#x672C;&#x5730;&#x7684;&#x6587;&#x4EF6;&#x3002;</li>
</ul>
<p>&#x5176;&#x4E2D;&#x672C;&#x5730;&#x6587;&#x4EF6;&#x53C8;&#x5206;&#x4E3A;&#x4E09;&#x79CD;&#xFF1A;</p>
<ol>
<li>&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#xFF1A;&#x4E34;&#x65F6;&#x4EA7;&#x751F;&#xFF0C;&#x968F;&#x65F6;&#x4F1A;&#x88AB;&#x56DE;&#x6536;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4E0D;&#x9650;&#x5236;&#x5B58;&#x50A8;&#x5927;&#x5C0F;&#x3002;</li>
<li>&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#xFF1A;&#x5C0F;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x628A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x7F13;&#x5B58;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x80FD;&#x81EA;&#x5B9A;&#x4E49;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x3002;&#x9664;&#x975E;&#x7528;&#x6237;&#x4E3B;&#x52A8;&#x5220;&#x9664;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x3002;&#x8DDF;&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x5171;&#x8BA1;&#xFF0C;&#x666E;&#x901A;&#x5C0F;&#x7A0B;&#x5E8F;&#x6700;&#x591A;&#x53EF;&#x5B58;&#x50A8; 10MB&#xFF0C;&#x6E38;&#x620F;&#x7C7B;&#x76EE;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x6700;&#x591A;&#x53EF;&#x5B58;&#x50A8; 50MB&#x3002;</li>
<li>&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#xFF1A;&#x5C0F;&#x7A0B;&#x5E8F;&#x901A;&#x8FC7;&#x63A5;&#x53E3;&#x628A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x7F13;&#x5B58;&#x540E;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5141;&#x8BB8;&#x81EA;&#x5B9A;&#x4E49;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x3002;&#x9664;&#x975E;&#x7528;&#x6237;&#x4E3B;&#x52A8;&#x5220;&#x9664;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x4F1A;&#x88AB;&#x5220;&#x9664;&#x3002;&#x8DDF;&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x5171;&#x8BA1;&#xFF0C;&#x666E;&#x901A;&#x5C0F;&#x7A0B;&#x5E8F;&#x6700;&#x591A;&#x53EF;&#x5B58;&#x50A8; 10MB&#xFF0C;&#x6E38;&#x620F;&#x7C7B;&#x76EE;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x6700;&#x591A;&#x53EF;&#x5B58;&#x50A8; 50MB&#x3002;</li>
</ol>
<h3 id="&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;">&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;</h3>
<p>&#x7531;&#x4E8E;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#x5927;&#x5C0F;&#x9650;&#x5236;&#xFF0C;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#x9002;&#x7528;&#x4E8E;&#x653E;&#x7F6E;&#x9996;&#x6B21;&#x52A0;&#x8F7D;&#x65F6;&#x9700;&#x8981;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5BF9;&#x4E8E;&#x5185;&#x5BB9;&#x8F83;&#x5927;&#x6216;&#x9700;&#x8981;&#x52A8;&#x6001;&#x66FF;&#x6362;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x4E0D;&#x63A8;&#x8350;&#x7528;&#x6DFB;&#x52A0;&#x5230;&#x4EE3;&#x7801;&#x5305;&#x4E2D;&#xFF0C;&#x63A8;&#x8350;&#x5728;&#x5C0F;&#x6E38;&#x620F;&#x542F;&#x52A8;&#x4E4B;&#x540E;&#x518D;&#x7528;&#x4E0B;&#x8F7D;&#x63A5;&#x53E3;&#x4E0B;&#x8F7D;&#x5230;&#x672C;&#x5730;&#x3002;</p>
<h4 id="&#x8BBF;&#x95EE;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;">&#x8BBF;&#x95EE;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;</h4>
<p>&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#x7684;&#x8BBF;&#x95EE;&#x65B9;&#x5F0F;&#x662F;&#x4ECE;&#x9879;&#x76EE;&#x6839;&#x76EE;&#x5F55;&#x5F00;&#x59CB;&#x5199;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#xFF0C;&#x4E0D;&#x652F;&#x6301;&#x76F8;&#x5BF9;&#x8DEF;&#x5F84;&#x7684;&#x5199;&#x6CD5;&#x3002;
<img src="https://developers.weixin.qq.com/miniprogram/dev/framework/ability/image/code-package.png?t=18122514" alt="image.png"></p>
<h4 id="&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;">&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;</h4>
<p>&#x4EE3;&#x7801;&#x5305;&#x5185;&#x7684;&#x6587;&#x4EF6;&#x65E0;&#x6CD5;&#x5728;&#x8FD0;&#x884C;&#x540E;&#x52A8;&#x6001;&#x4FEE;&#x6539;&#x6216;&#x5220;&#x9664;&#xFF0C;&#x4FEE;&#x6539;&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x53D1;&#x5E03;&#x7248;&#x672C;&#x3002;</p>
<h3 id="&#x672C;&#x5730;&#x6587;&#x4EF6;">&#x672C;&#x5730;&#x6587;&#x4EF6;</h3>
<p>&#x672C;&#x5730;&#x6587;&#x4EF6;&#x6307;&#x7684;&#x662F;&#x5C0F;&#x7A0B;&#x5E8F;&#x88AB;&#x7528;&#x6237;&#x6DFB;&#x52A0;&#x5230;&#x624B;&#x673A;&#x540E;&#xFF0C;&#x4F1A;&#x6709;&#x4E00;&#x5757;&#x72EC;&#x7ACB;&#x7684;&#x6587;&#x4EF6;&#x5B58;&#x50A8;&#x533A;&#x57DF;&#xFF0C;&#x4EE5;&#x7528;&#x6237;&#x7EF4;&#x5EA6;&#x9694;&#x79BB;&#x3002;&#x5373;&#x540C;&#x4E00;&#x53F0;&#x624B;&#x673A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5FAE;&#x4FE1;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x5230;&#x5176;&#x4ED6;&#x767B;&#x5F55;&#x7528;&#x6237;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x540C;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x4E0D;&#x540C; appId &#x4E4B;&#x95F4;&#x7684;&#x6587;&#x4EF6;&#x4E5F;&#x4E0D;&#x80FD;&#x4E92;&#x76F8;&#x8BBF;&#x95EE;&#x3002;
<img src="https://developers.weixin.qq.com/miniprogram/dev/framework/ability/image/file-sandbox.png?t=18122514" alt="&#x672C;&#x5730;&#x6587;&#x4EF6;&#x6C99;&#x76D2;.png"></p>
<p>&#x672C;&#x5730;&#x6587;&#x4EF6;&#x7684;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x5747;&#x4E3A;&#x4EE5;&#x4E0B;&#x683C;&#x5F0F;&#xFF1A;</p>
<pre><code>{{&#x534F;&#x8BAE;&#x540D;}}://&#x6587;&#x4EF6;&#x8DEF;&#x5F84;
</code></pre>
<blockquote>
<p>&#x5176;&#x4E2D;&#xFF0C;&#x534F;&#x8BAE;&#x540D;&#x5728; iOS/Android &#x5BA2;&#x6237;&#x7AEF;&#x4E3A; <code>&quot;wxfile&quot;</code>&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E0A;&#x4E3A; <code>&quot;http&quot;</code>&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x65E0;&#x9700;&#x5173;&#x6CE8;&#x8FD9;&#x4E2A;&#x5DEE;&#x5F02;&#xFF0C;&#x4E5F;&#x4E0D;&#x5E94;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x53BB;&#x786C;&#x7F16;&#x7801;&#x5B8C;&#x6574;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x3002;</p>
</blockquote>
<h4 id="&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;">&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;</h4>
<p>&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7279;&#x5B9A;&#x63A5;&#x53E3;&#x4EA7;&#x751F;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5199;&#x5165;&#x5185;&#x5BB9;&#x3002;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x4EC5;&#x5728;&#x5F53;&#x524D;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x6709;&#x6548;&#xFF0C;&#x91CD;&#x542F;&#x4E4B;&#x540E;&#x5373;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x56E0;&#x6B64;&#xFF0C;<strong>&#x4E0D;&#x53EF;&#x628A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#x4E0B;&#x6B21;&#x4F7F;&#x7528;</strong>&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4E0B;&#x6B21;&#x5728;&#x4F7F;&#x7528;&#xFF0C;&#x53EF;&#x901A;&#x8FC7; <a href="../../api/FileSystemManager.saveFile.html">FileSystemManager.saveFile()</a> &#x6216; <a href="../../api/FileSystemManager.copyFile.html">FileSystemManager.copyFile()</a> &#x63A5;&#x53E3;&#x628A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x8F6C;&#x6362;&#x6210;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x6216;&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x3002;</p>
<h5 id="&#x793A;&#x4F8B;">&#x793A;&#x4F8B;</h5>
<pre><code class="language-javascript">wx.chooseImage({
  success(res) {
    <span class="hljs-keyword">const</span> tempFilePaths = res.tempFilePaths <span class="hljs-comment">// tempFilePaths &#x7684;&#x6BCF;&#x4E00;&#x9879;&#x662F;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;</span>
  }
})
</code></pre>
<h4 id="&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;">&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;</h4>
<p>&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x8C03;&#x7528;&#x7279;&#x5B9A;&#x63A5;&#x53E3;&#x4EA7;&#x751F;&#xFF0C;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x5199;&#x5165;&#x5185;&#x5BB9;&#x3002;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x4EA7;&#x751F;&#x540E;&#xFF0C;&#x91CD;&#x542F;&#x4E4B;&#x540E;&#x4ECD;&#x53EF;&#x7528;&#x3002;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x53EA;&#x80FD;&#x901A;&#x8FC7; <a href="../../api/FileSystemManager.saveFile.html">FileSystemManager.saveFile()</a> &#x63A5;&#x53E3;&#x5C06;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x4FDD;&#x5B58;&#x83B7;&#x5F97;&#x3002;</p>
<h5 id="&#x793A;&#x4F8B;-2">&#x793A;&#x4F8B;</h5>
<pre><code class="language-javascript">fs.saveFile({
  <span class="hljs-attr">tempFilePath</span>: <span class="hljs-string">&apos;&apos;</span>, <span class="hljs-comment">// &#x4F20;&#x5165;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;</span>
  success(res) {
    <span class="hljs-built_in">console</span>.log(res.savedFilePath) <span class="hljs-comment">// res.savedFilePath &#x4E3A;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x8DEF;&#x5F84;</span>
  }
})
</code></pre>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x662F;&#x6700;&#x521D;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;<code>1.7.0</code> &#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x529F;&#x80FD;&#x66F4;&#x5B8C;&#x6574;&#x7684;&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5B8C;&#x5168;&#x8986;&#x76D6;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x9700;&#x8981;&#x517C;&#x5BB9;&#x4F4E;&#x4E8E; <code>1.7.0</code> &#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0D;&#x4F7F;&#x7528;&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#x3002;</strong></p>
<h4 id="&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;">&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;</h4>
<p>&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x662F;&#x4ECE; <code>1.7.0</code> &#x7248;&#x672C;&#x5F00;&#x59CB;&#x65B0;&#x589E;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x7ED9;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x6709;&#x5B8C;&#x5168;&#x81EA;&#x7531;&#x7684;&#x8BFB;&#x5199;&#x6743;&#x9650;&#x3002;&#x901A;&#x8FC7; <code>wx.env.USER_DATA_PATH</code> &#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x8DEF;&#x5F84;&#x3002;</p>
<h5 id="&#x793A;&#x4F8B;-3">&#x793A;&#x4F8B;</h5>
<pre><code class="language-javascript"><span class="hljs-comment">// &#x5728;&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x4E0B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6; hello.txt&#xFF0C;&#x5199;&#x5165;&#x5185;&#x5BB9; &quot;hello, world&quot;</span>
<span class="hljs-keyword">const</span> fs = wx.getFileSystemManager()
fs.writeFileSync(<span class="hljs-string">`<span class="hljs-subst">${wx.env.USER_DATA_PATH}</span>/hello.txt`</span>, <span class="hljs-string">&apos;hello, world&apos;</span>, <span class="hljs-string">&apos;utf8&apos;</span>)
</code></pre>
<h3 id="&#x8BFB;&#x5199;&#x6743;&#x9650;">&#x8BFB;&#x5199;&#x6743;&#x9650;</h3>
<table>
<thead>
<tr>
<th>&#x63A5;&#x53E3;&#x3001;&#x7EC4;&#x4EF6;</th>
<th>&#x8BFB;</th>
<th>&#x5199;</th>
</tr>
</thead>
<tbody>
<tr>
<td>&#x4EE3;&#x7801;&#x5305;&#x6587;&#x4EF6;</td>
<td>&#x6709;</td>
<td>&#x65E0;</td>
</tr>
<tr>
<td>&#x672C;&#x5730;&#x4E34;&#x65F6;&#x6587;&#x4EF6;</td>
<td>&#x6709;</td>
<td>&#x65E0;</td>
</tr>
<tr>
<td>&#x672C;&#x5730;&#x7F13;&#x5B58;&#x6587;&#x4EF6;</td>
<td>&#x6709;</td>
<td>&#x65E0;</td>
</tr>
<tr>
<td>&#x672C;&#x5730;&#x7528;&#x6237;&#x6587;&#x4EF6;</td>
<td>&#x6709;</td>
<td>&#x6709;</td>
</tr>
</tbody>
</table>

                            </section>
                        </div>
                        
                    </div>
                
</body>
</html>
