<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>基础能力</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                              <h2 id="&#x7F51;&#x7EDC;">&#x7F51;&#x7EDC;</h2>
<p>&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;/&#x5C0F;&#x6E38;&#x620F;&#x4E2D;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x76F8;&#x5173;&#x7684; API &#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E0B;&#x5217;&#x95EE;&#x9898;&#xFF0C;&#x8BF7;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x524D;&#x4E86;&#x89E3;&#x3002;</p>
<h3 id="1-&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x914D;&#x7F6E;">1. &#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x914D;&#x7F6E;</h3>
<p>&#x6BCF;&#x4E2A;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4E8B;&#x5148;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x901A;&#x8BAF;&#x57DF;&#x540D;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;<strong>&#x53EA;&#x53EF;&#x4EE5;&#x8DDF;&#x6307;&#x5B9A;&#x7684;&#x57DF;&#x540D;&#x4E0E;&#x8FDB;&#x884C;&#x7F51;&#x7EDC;&#x901A;&#x4FE1;</strong>&#x3002;&#x5305;&#x62EC;&#x666E;&#x901A; HTTPS &#x8BF7;&#x6C42;&#xFF08;<code>request</code>&#xFF09;&#x3001;&#x4E0A;&#x4F20;&#x6587;&#x4EF6;&#xFF08;<code>uploadFile</code>&#xFF09;&#x3001;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#xFF08;<code>downloadFile</code>) &#x548C; WebSocket &#x901A;&#x4FE1;&#xFF08;<code>connectSocket</code>&#xFF09;</p>
<h4 id="&#x914D;&#x7F6E;&#x6D41;&#x7A0B;">&#x914D;&#x7F6E;&#x6D41;&#x7A0B;</h4>
<p>&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x8BF7;&#x5728; &#x300C;&#x5C0F;&#x7A0B;&#x5E8F;&#x540E;&#x53F0;-&#x8BBE;&#x7F6E;-&#x5F00;&#x53D1;&#x8BBE;&#x7F6E;-&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x300D; &#x4E2D;&#x8FDB;&#x884C;&#x914D;&#x7F6E;&#xFF0C;&#x914D;&#x7F6E;&#x65F6;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<ul>
<li>&#x57DF;&#x540D;&#x53EA;&#x652F;&#x6301; <code>https</code> (<code>request</code>&#x3001;<code>uploadFile</code>&#x3001;<code>downloadFile</code>) &#x548C; <code>wss</code> (<code>connectSocket</code>) &#x534F;&#x8BAE;&#xFF1B;</li>
<li>&#x57DF;&#x540D;&#x4E0D;&#x80FD;&#x4F7F;&#x7528; IP &#x5730;&#x5740;&#x6216; localhost&#xFF1B;</li>
<li>&#x57DF;&#x540D;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7; ICP &#x5907;&#x6848;&#xFF1B;</li>
<li><strong>&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x8003;&#x8651;&#xFF0C;<code>api.weixin.qq.com</code> &#x4E0D;&#x80FD;&#x88AB;&#x914D;&#x7F6E;&#x4E3A;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#xFF0C;&#x76F8;&#x5173;API&#x4E5F;&#x4E0D;&#x80FD;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x5185;&#x8C03;&#x7528;&#x3002;</strong> &#x5F00;&#x53D1;&#x8005;&#x5E94;&#x5C06; appsecret &#x4FDD;&#x5B58;&#x5230;&#x540E;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528; appsecret &#x83B7;&#x53D6; accesstoken&#xFF0C;&#x5E76;&#x8C03;&#x7528;&#x76F8;&#x5173; API&#xFF1B;</li>
<li>&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x5206;&#x522B;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x6700;&#x591A; 20 &#x4E2A;&#x57DF;&#x540D;&#x3002;</li>
</ul>
<h3 id="2-&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;">2. &#x7F51;&#x7EDC;&#x8BF7;&#x6C42;</h3>
<h4 id="&#x8D85;&#x65F6;&#x65F6;&#x95F4;">&#x8D85;&#x65F6;&#x65F6;&#x95F4;</h4>
<ul>
<li>&#x9ED8;&#x8BA4;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x548C;&#x6700;&#x5927;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x90FD;&#x662F; <strong>60s</strong>&#xFF1B;</li>
<li>&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x53EF;&#x4EE5;&#x5728; <a href="../config.html#networktimeout"><code>app.json</code></a> &#x4E2D;&#x914D;&#x7F6E;&#x3002;</li>
</ul>
<h4 id="&#x4F7F;&#x7528;&#x9650;&#x5236;">&#x4F7F;&#x7528;&#x9650;&#x5236;</h4>
<ul>
<li>&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x7684; <code>referer</code> header &#x4E0D;&#x53EF;&#x8BBE;&#x7F6E;&#x3002;&#x5176;&#x683C;&#x5F0F;&#x56FA;&#x5B9A;&#x4E3A; <code>https://servicewechat.com/{appid}/{version}/page-frame.html</code>&#xFF0C;&#x5176;&#x4E2D; <code>{appid}</code> &#x4E3A;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684; appid&#xFF0C;<code>{version}</code> &#x4E3A;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x7248;&#x672C;&#x53F7;&#x4E3A; <code>0</code> &#x8868;&#x793A;&#x4E3A;&#x5F00;&#x53D1;&#x7248;&#x3001;&#x4F53;&#x9A8C;&#x7248;&#x4EE5;&#x53CA;&#x5BA1;&#x6838;&#x7248;&#x672C;&#xFF0C;&#x7248;&#x672C;&#x53F7;&#x4E3A; <code>devtools</code> &#x8868;&#x793A;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#xFF0C;&#x5176;&#x4F59;&#x4E3A;&#x6B63;&#x5F0F;&#x7248;&#x672C;&#xFF1B;</li>
<li><code>request</code>&#x3001;<code>uploadFile</code>&#x3001;<code>downloadFile</code> &#x7684;&#x6700;&#x5927;&#x5E76;&#x53D1;&#x9650;&#x5236;&#x662F; <strong>10</strong> &#x4E2A;&#xFF1B;</li>
<li>&#x5C0F;&#x7A0B;&#x5E8F;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x540E;&#xFF08;&#x975E;&#x7F6E;&#x9876;&#x804A;&#x5929;&#xFF09;&#xFF0C;&#x5982;&#x679C; <strong>5s</strong> &#x5185;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x6CA1;&#x6709;&#x7ED3;&#x675F;&#xFF0C;&#x4F1A;&#x56DE;&#x8C03;&#x9519;&#x8BEF;&#x4FE1;&#x606F; <code>fail interrupted</code>&#xFF1B;&#x5728;&#x56DE;&#x5230;&#x524D;&#x53F0;&#x4E4B;&#x524D;&#xFF0C;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x63A5;&#x53E3;&#x8C03;&#x7528;&#x90FD;&#x4F1A;&#x65E0;&#x6CD5;&#x8C03;&#x7528;&#x3002;</li>
</ul>
<h4 id="&#x8FD4;&#x56DE;&#x503C;&#x7F16;&#x7801;">&#x8FD4;&#x56DE;&#x503C;&#x7F16;&#x7801;</h4>
<ul>
<li>&#x5EFA;&#x8BAE;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x503C;&#x4F7F;&#x7528; <strong>UTF-8</strong> &#x7F16;&#x7801;&#x3002;&#x5BF9;&#x4E8E;&#x975E; UTF-8 &#x7F16;&#x7801;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F1A;&#x5C1D;&#x8BD5;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x6709;&#x8F6C;&#x6362;&#x5931;&#x8D25;&#x7684;&#x53EF;&#x80FD;&#x3002;</li>
<li>&#x5C0F;&#x7A0B;&#x5E8F;&#x4F1A;&#x81EA;&#x52A8;&#x5BF9; BOM &#x5934;&#x8FDB;&#x884C;&#x8FC7;&#x6EE4;&#xFF08;&#x53EA;&#x8FC7;&#x6EE4;&#x4E00;&#x4E2A;BOM&#x5934;&#xFF09;&#x3002;</li>
</ul>
<h4 id="&#x56DE;&#x8C03;&#x51FD;&#x6570;">&#x56DE;&#x8C03;&#x51FD;&#x6570;</h4>
<ul>
<li><strong>&#x53EA;&#x8981;&#x6210;&#x529F;&#x63A5;&#x6536;&#x5230;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#xFF0C;&#x65E0;&#x8BBA; <code>statusCode</code> &#x662F;&#x591A;&#x5C11;&#xFF0C;&#x90FD;&#x4F1A;&#x8FDB;&#x5165; <code>success</code> &#x56DE;&#x8C03;&#x3002;&#x8BF7;&#x5F00;&#x53D1;&#x8005;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5BF9;&#x8FD4;&#x56DE;&#x503C;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</strong></li>
</ul>
<h3 id="3-&#x5E38;&#x89C1;&#x95EE;&#x9898;">3. &#x5E38;&#x89C1;&#x95EE;&#x9898;</h3>
<h4 id="https-&#x8BC1;&#x4E66;">HTTPS &#x8BC1;&#x4E66;</h4>
<p><strong>&#x5C0F;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x4F7F;&#x7528; HTTPS/WSS &#x53D1;&#x8D77;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;</strong>&#x3002;&#x8BF7;&#x6C42;&#x65F6;&#x7CFB;&#x7EDF;&#x4F1A;&#x5BF9;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x4F7F;&#x7528;&#x7684; HTTPS &#x8BC1;&#x4E66;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF0C;&#x5982;&#x679C;&#x6821;&#x9A8C;&#x5931;&#x8D25;&#xFF0C;&#x5219;&#x8BF7;&#x6C42;&#x4E0D;&#x80FD;&#x6210;&#x529F;&#x53D1;&#x8D77;&#x3002;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x9650;&#x5236;&#xFF0C;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x5BF9;&#x4E8E;&#x8BC1;&#x4E66;&#x8981;&#x6C42;&#x7684;&#x4E25;&#x683C;&#x7A0B;&#x5EA6;&#x4E0D;&#x540C;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x517C;&#x5BB9;&#x6027;&#xFF0C;&#x5EFA;&#x8BAE;&#x5F00;&#x53D1;&#x8005;&#x6309;&#x7167;&#x6700;&#x9AD8;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x8BC1;&#x4E66;&#x914D;&#x7F6E;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x76F8;&#x5173;&#x5DE5;&#x5177;&#x68C0;&#x67E5;&#x73B0;&#x6709;&#x8BC1;&#x4E66;&#x662F;&#x5426;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x3002;</p>
<p>&#x5BF9;&#x8BC1;&#x4E66;&#x8981;&#x6C42;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>HTTPS &#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x6709;&#x6548;&#xFF1B;
<ul>
<li>&#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x88AB;&#x7CFB;&#x7EDF;&#x4FE1;&#x4EFB;&#xFF0C;&#x5373;&#x6839;&#x8BC1;&#x4E66;&#x88AB;&#x5DF2;&#x7CFB;&#x7EDF;&#x5185;&#x7F6E;</li>
<li>&#x90E8;&#x7F72; SSL &#x8BC1;&#x4E66;&#x7684;&#x7F51;&#x7AD9;&#x57DF;&#x540D;&#x5FC5;&#x987B;&#x4E0E;&#x8BC1;&#x4E66;&#x9881;&#x53D1;&#x7684;&#x57DF;&#x540D;&#x4E00;&#x81F4;</li>
<li>&#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x5728;&#x6709;&#x6548;&#x671F;&#x5185;</li>
<li>&#x8BC1;&#x4E66;&#x7684;&#x4FE1;&#x4EFB;&#x94FE;&#x5FC5;&#x9700;&#x5B8C;&#x6574;&#xFF08;&#x9700;&#x8981;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;&#xFF09;</li>
</ul>
</li>
<li><code>iOS</code> &#x4E0D;&#x652F;&#x6301;&#x81EA;&#x7B7E;&#x540D;&#x8BC1;&#x4E66;;</li>
<li><code>iOS</code> &#x4E0B;&#x8BC1;&#x4E66;&#x5FC5;&#x987B;&#x6EE1;&#x8DB3;&#x82F9;&#x679C;  <a href="https://developer.apple.com/library/content/documentation/General/Reference/InfoPlistKeyReference/Articles/CocoaKeys.html#//apple_ref/doc/uid/TP40009251-SW33" target="_blank">App Transport Security (ATS)</a> &#x7684;&#x8981;&#x6C42;;</li>
<li>TLS &#x5FC5;&#x987B;&#x652F;&#x6301; 1.2 &#x53CA;&#x4EE5;&#x4E0A;&#x7248;&#x672C;&#x3002;&#x90E8;&#x5206;&#x65E7; <code>Android</code> &#x673A;&#x578B;&#x8FD8;&#x672A;&#x652F;&#x6301; TLS 1.2&#xFF0C;&#x8BF7;&#x786E;&#x4FDD; HTTPS &#x670D;&#x52A1;&#x5668;&#x7684; TLS &#x7248;&#x672C;&#x652F;&#x6301; 1.2 &#x53CA;&#x4EE5;&#x4E0B;&#x7248;&#x672C;;</li>
<li>&#x90E8;&#x5206; CA &#x53EF;&#x80FD;&#x4E0D;&#x88AB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4FE1;&#x4EFB;&#xFF0C;&#x8BF7;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x9009;&#x62E9;&#x8BC1;&#x4E66;&#x65F6;&#x6CE8;&#x610F;&#x5C0F;&#x7A0B;&#x5E8F;&#x548C;&#x5404;&#x7CFB;&#x7EDF;&#x7684;&#x76F8;&#x5173;&#x901A;&#x544A;&#x3002;
<ul>
<li><a href="https://developers.weixin.qq.com/community/develop/doc/800026caeb042e45681583652b70910a" target="_blank">Chrome 56/57 &#x5185;&#x6838;&#x5BF9; WoSign&#x3001;StartCom &#x8BC1;&#x4E66;&#x9650;&#x5236;&#x5468;&#x77E5;</a></li>
</ul>
</li>
</ul>
<blockquote>
<p>&#x8BC1;&#x4E66;&#x6709;&#x6548;&#x6027;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>openssl s_client -connect example.com:443</code> &#x547D;&#x4EE4;&#x9A8C;&#x8BC1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;<a href="https://myssl.com/ssl.html" target="_blank">&#x5728;&#x7EBF;&#x5DE5;&#x5177;</a>&#x3002;</p>
</blockquote>
<p><strong>&#x9664;&#x4E86;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42; API &#x5916;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E2D;&#x5176;&#x4ED6; <code>HTTPS</code> &#x8BF7;&#x6C42;&#x5982;&#x679C;&#x51FA;&#x73B0;&#x5F02;&#x5E38;&#xFF0C;&#x4E5F;&#x8BF7;&#x6309;&#x4E0A;&#x8FF0;&#x6D41;&#x7A0B;&#x8FDB;&#x884C;&#x68C0;&#x67E5;&#x3002;&#x5982; https &#x7684;&#x56FE;&#x7247;&#x65E0;&#x6CD5;&#x52A0;&#x8F7D;&#x3001;&#x97F3;&#x89C6;&#x9891;&#x65E0;&#x6CD5;&#x64AD;&#x653E;&#x7B49;&#x3002;</strong></p>
<h4 id="&#x8DF3;&#x8FC7;&#x57DF;&#x540D;&#x6821;&#x9A8C;">&#x8DF3;&#x8FC7;&#x57DF;&#x540D;&#x6821;&#x9A8C;</h4>
<p>&#x5728;&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4E34;&#x65F6;&#x5F00;&#x542F; <code>&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x4E0D;&#x6821;&#x9A8C;&#x8BF7;&#x6C42;&#x57DF;&#x540D;&#x3001;TLS&#x7248;&#x672C;&#x53CA;HTTPS&#x8BC1;&#x4E66;</code> &#x9009;&#x9879;&#xFF0C;&#x8DF3;&#x8FC7;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x7684;&#x6821;&#x9A8C;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x5728;&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E2D;&#x53CA;&#x624B;&#x673A;&#x5F00;&#x542F;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x4E0D;&#x4F1A;&#x8FDB;&#x884C;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x7684;&#x6821;&#x9A8C;&#x3002;</p>
<p><strong>&#x5728;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x914D;&#x7F6E;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x5EFA;&#x8BAE;&#x5F00;&#x53D1;&#x8005;&#x5173;&#x95ED;&#x6B64;&#x9009;&#x9879;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF0C;&#x5E76;&#x5728;&#x5404;&#x5E73;&#x53F0;&#x4E0B;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x4EE5;&#x786E;&#x8BA4;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x914D;&#x7F6E;&#x6B63;&#x786E;&#x3002;</strong></p>
<blockquote>
<p>&#x5982;&#x679C;&#x624B;&#x673A;&#x4E0A;&#x51FA;&#x73B0; &#x201C;&#x6253;&#x5F00;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#xFF0C;&#x5173;&#x95ED;&#x8C03;&#x8BD5;&#x6A21;&#x5F0F;&#x65E0;&#x6CD5;&#x53D1;&#x51FA;&#x8BF7;&#x6C42;&#x201D; &#x7684;&#x73B0;&#x8C61;&#xFF0C;&#x8BF7;&#x786E;&#x8BA4;&#x662F;&#x5426;&#x8DF3;&#x8FC7;&#x4E86;&#x57DF;&#x540D;&#x6821;&#x9A8C;&#xFF0C;&#x5E76;&#x786E;&#x8BA4;&#x670D;&#x52A1;&#x5668;&#x57DF;&#x540D;&#x548C;&#x8BC1;&#x4E66;&#x914D;&#x7F6E;&#x662F;&#x5426;&#x6B63;&#x786E;&#x3002;</p>
</blockquote>

                            </section>
                        </div>
                        
                    </div>
                
</body>
</html>
