<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>开发插件</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                              <h1 id="&#x5F00;&#x53D1;&#x63D2;&#x4EF6;">&#x5F00;&#x53D1;&#x63D2;&#x4EF6;</h1>
<p>&#x5F00;&#x53D1;&#x63D2;&#x4EF6;&#x524D;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;&#x4E86;&#x89E3;<a href="https://developers.weixin.qq.com/miniprogram/introduction/plugin.html?t=19022219">&#x300A;&#x5C0F;&#x7A0B;&#x5E8F;&#x63D2;&#x4EF6;&#x63A5;&#x5165;&#x6307;&#x5357;&#x300B;</a>&#x4E86;&#x89E3;&#x5F00;&#x901A;&#x6D41;&#x7A0B;&#x53CA;&#x5F00;&#x653E;&#x8303;&#x56F4;&#xFF0C;&#x5E76;&#x5F00;&#x901A;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x3002;&#x5982;&#x679C;&#x672A;&#x5F00;&#x901A;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#xFF0C;&#x5C06;&#x65E0;&#x6CD5;&#x4E0A;&#x4F20;&#x63D2;&#x4EF6;&#x3002;</p>
<h2 id="&#x521B;&#x5EFA;&#x63D2;&#x4EF6;&#x9879;&#x76EE;">&#x521B;&#x5EFA;&#x63D2;&#x4EF6;&#x9879;&#x76EE;</h2>
<p>&#x63D2;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E2D;&#x76F4;&#x63A5;&#x521B;&#x5EFA;&#x3002;<a href="../../devtools/plugin.html">&#x8BE6;&#x60C5;</a></p>
<p><img src="https://developers.weixin.qq.com/miniprogram/dev/devtools/image/devtools2/createplugin.png?t=19022219" alt="&#x521B;&#x5EFA;&#x63D2;&#x4EF6;" onerror="this.src !== &apos;../../devtools/image/devtools2/createplugin.png?t=19022219&apos; &amp;&amp; (this.src = &apos;../../devtools/image/devtools2/createplugin.png?t=19022219&apos;)"></p>
<p>&#x65B0;&#x5EFA;&#x63D2;&#x4EF6;&#x7C7B;&#x578B;&#x7684;&#x9879;&#x76EE;&#x540E;&#xFF0C;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x793A;&#x4F8B;&#x9879;&#x76EE;&#xFF0C;&#x5219;&#x9879;&#x76EE;&#x4E2D;&#x5C06;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x76EE;&#x5F55;&#xFF1A;</p>
<ul>
<li><code>plugin</code> &#x76EE;&#x5F55;&#xFF1A;&#x63D2;&#x4EF6;&#x4EE3;&#x7801;&#x76EE;&#x5F55;&#x3002;</li>
<li><code>miniprogram</code> &#x76EE;&#x5F55;&#xFF1A;&#x653E;&#x7F6E;&#x4E00;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x7528;&#x4E8E;&#x8C03;&#x8BD5;&#x63D2;&#x4EF6;&#x3002;</li>
<li><code>doc</code> &#x76EE;&#x5F55;&#xFF1A;&#x7528;&#x4E8E;&#x653E;&#x7F6E;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x3002;</li>
</ul>
<p><code>miniprogram</code> &#x76EE;&#x5F55;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x5F53;&#x6210;&#x666E;&#x901A;&#x5C0F;&#x7A0B;&#x5E8F;&#x6765;&#x7F16;&#x5199;&#xFF0C;&#x7528;&#x4E8E;&#x63D2;&#x4EF6;&#x8C03;&#x8BD5;&#x3001;&#x9884;&#x89C8;&#x548C;&#x5BA1;&#x6838;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x4E3B;&#x8981;&#x4ECB;&#x7ECD; <code>plugin</code> &#x4E2D;&#x7684;&#x63D2;&#x4EF6;&#x4EE3;&#x7801;&#x53CA; <code>doc</code> &#x4E2D;&#x7684;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;<a href="https://developers.weixin.qq.com/s/NrPCBmmT7B1B" target="_blank">&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E2D;&#x67E5;&#x770B;&#x7684;&#x5B8C;&#x6574;&#x63D2;&#x4EF6;&#x793A;&#x4F8B;</a>&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x548C;&#x672C;&#x6587;&#x4E92;&#x76F8;&#x5BF9;&#x7167;&#x4EE5;&#x4FBF;&#x7406;&#x89E3;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF1A;</p>
<ol>
<li>&#x7531;&#x4E8E;&#x63D2;&#x4EF6;&#x9700;&#x8981; appid &#x624D;&#x80FD;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x586B;&#x5165;&#x4E00;&#x4E2A; appid&#xFF1B;</li>
<li>&#x7531;&#x4E8E;&#x5F53;&#x524D;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x6253;&#x5F00;&#x8BE5;&#x793A;&#x4F8B;&#x540E;&#x8BF7; <strong>&#x624B;&#x52A8;&#x5C06; appid &#x586B;&#x5199;&#x5230; <code>miniprogram/app.json</code> &#x4E2D;&#xFF08;&#x5982;&#x4E0B;&#x56FE;&#xFF09;&#x4F7F;&#x793A;&#x4F8B;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x3002;</strong></li>
</ol>
<p><img src="https://developers.weixin.qq.com/miniprogram/dev/image/plugin_minicode_guide.png?t=19022219" alt="&#x624B;&#x52A8;&#x586B;&#x5199; appid" onerror="this.src !== &apos;../../image/plugin_minicode_guide.png?t=19022219&apos; &amp;&amp; (this.src = &apos;../../image/plugin_minicode_guide.png?t=19022219&apos;)"></p>
<h2 id="&#x63D2;&#x4EF6;&#x76EE;&#x5F55;&#x7ED3;&#x6784;">&#x63D2;&#x4EF6;&#x76EE;&#x5F55;&#x7ED3;&#x6784;</h2>
<p>&#x4E00;&#x4E2A;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x82E5;&#x5E72;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x3001;&#x9875;&#x9762;&#xFF0C;&#x548C;&#x4E00;&#x7EC4; js &#x63A5;&#x53E3;&#x3002;&#x63D2;&#x4EF6;&#x7684;&#x76EE;&#x5F55;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>plugin
&#x251C;&#x2500;&#x2500; components
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-component.js   // &#x63D2;&#x4EF6;&#x63D0;&#x4F9B;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#xFF08;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#xFF09;
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-component.json
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-component.wxml
&#x2502;&#xA0;&#xA0; &#x2514;&#x2500;&#x2500; hello-component.wxss
&#x251C;&#x2500;&#x2500; pages
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-page.js        // &#x63D2;&#x4EF6;&#x63D0;&#x4F9B;&#x7684;&#x9875;&#x9762;&#xFF08;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#xFF0C;&#x81EA;&#x5C0F;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#x5E93;&#x7248;&#x672C; 2.1.0 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF09;
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-page.json
&#x2502;&#xA0;&#xA0; &#x251C;&#x2500;&#x2500; hello-page.wxml
&#x2502;&#xA0;&#xA0; &#x2514;&#x2500;&#x2500; hello-page.wxss
&#x251C;&#x2500;&#x2500; index.js                 // &#x63D2;&#x4EF6;&#x7684; js &#x63A5;&#x53E3;
&#x2514;&#x2500;&#x2500; plugin.json              // &#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;
</code></pre>
<h2 id="&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;">&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;</h2>
<p>&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x653E;&#x7684;&#x6240;&#x6709;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x3001;&#x9875;&#x9762;&#x548C; js &#x63A5;&#x53E3;&#x90FD;&#x5FC5;&#x987B;&#x5728;&#x63D2;&#x4EF6;&#x914D;&#x7F6E;&#x6587;&#x4EF6; <code>plugin.json</code> &#x5217;&#x51FA;&#xFF0C;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</strong></p>
<pre><code class="language-json">{
  <span class="hljs-attr">&quot;publicComponents&quot;</span>: {
    <span class="hljs-attr">&quot;hello-component&quot;</span>: <span class="hljs-string">&quot;components/hello-component&quot;</span>
  },
  <span class="hljs-attr">&quot;pages&quot;</span>: {
    <span class="hljs-attr">&quot;hello-page&quot;</span>: <span class="hljs-string">&quot;pages/hello-page&quot;</span>
  },
  <span class="hljs-attr">&quot;main&quot;</span>: <span class="hljs-string">&quot;index.js&quot;</span>
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5C06;&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x653E;&#x4E00;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6; <code>hello-component</code>&#xFF0C;&#x4E00;&#x4E2A;&#x9875;&#x9762; <code>hello-page</code> &#x548C; <code>index.js</code> &#x4E0B;&#x5BFC;&#x51FA;&#x7684;&#x6240;&#x6709; js &#x63A5;&#x53E3;&#x3002;</p>
<h2 id="&#x8FDB;&#x884C;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;">&#x8FDB;&#x884C;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;</h2>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF1A;&#x5728;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;<a href="api-limit.html">&#x90E8;&#x5206;&#x63A5;&#x53E3;</a>&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#xFF1B;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x90E8;&#x5206;&#x80FD;&#x529B;&#xFF08;&#x5982; &#x83B7;&#x53D6;&#x7528;&#x6237;&#x4FE1;&#x606F; &#x548C; &#x53D1;&#x8D77;&#x652F;&#x4ED8; &#x7B49;&#xFF09;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;<a href="functional-pages.html">&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;</a>&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;">&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;</h3>
<p>&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x82E5;&#x5E72;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x63D2;&#x4EF6;&#x5185;&#x76F8;&#x4E92;&#x5F15;&#x7528;&#x3002;&#x4F46;&#x63D0;&#x4F9B;&#x7ED9;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x5FC5;&#x987B;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5217;&#x51FA;&#xFF08;&#x53C2;&#x8003;&#x4E0A;&#x6587;&#xFF09;&#x3002;</p>
<p>&#x9664;&#x53BB;&#x63A5;&#x53E3;&#x9650;&#x5236;&#x4EE5;&#x5916;&#xFF0C;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x7684;&#x7F16;&#x5199;&#x548C;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x4E0E;&#x4E00;&#x822C;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x76F8;&#x540C;&#xFF0C;&#x6BCF;&#x4E2A;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x7531; <code>wxml</code>, <code>wxss</code>, <code>js</code> &#x548C; <code>json</code> &#x56DB;&#x4E2A;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#x3002;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="https://developers.weixin.qq.com/miniprogram/dev/framework/custom-component/?t=19022219">&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x7684;&#x6587;&#x6863;</a>&#x3002;</p>
<h3 id="&#x9875;&#x9762;">&#x9875;&#x9762;</h3>
<p>&#x63D2;&#x4EF6;&#x4ECE;&#x5C0F;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#x5E93;&#x7248;&#x672C; <a href="../compatibility.html" title="&#x57FA;&#x7840;&#x5E93; 2.1.0 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x9700;&#x505A;&#x517C;&#x5BB9;&#x5904;&#x7406;&#x3002;">2.1.0</a> &#x5F00;&#x59CB;&#x652F;&#x6301;&#x9875;&#x9762;&#x3002;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x82E5;&#x5E72;&#x4E2A;&#x63D2;&#x4EF6;&#x9875;&#x9762;&#xFF0C;&#x53EF;&#x4EE5;&#x4ECE;&#x672C;&#x63D2;&#x4EF6;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x3001;&#x5176;&#x4ED6;&#x9875;&#x9762;&#x4E2D;&#x8DF3;&#x8F6C;&#xFF0C;&#x6216;&#x4ECE;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E2D;&#x8DF3;&#x8F6C;&#x3002;&#x5176;&#x4E2D;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x8DF3;&#x8F6C;&#x7684;&#x9875;&#x9762;&#x5FC5;&#x987B;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x5217;&#x51FA;&#xFF08;&#x53C2;&#x8003;&#x4E0A;&#x6587;&#xFF09;&#x3002;</p>
<p>&#x9664;&#x53BB;&#x63A5;&#x53E3;&#x9650;&#x5236;&#x4EE5;&#x5916;&#xFF0C;&#x63D2;&#x4EF6;&#x7684;&#x9875;&#x9762;&#x7F16;&#x5199;&#x548C;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x4E0E;&#x4E00;&#x822C;&#x7684;&#x9875;&#x9762;&#x76F8;&#x540C;&#xFF0C;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x7531; <code>wxml</code>, <code>wxss</code>, <code>js</code> &#x548C; <code>json</code> &#x56DB;&#x4E2A;&#x6587;&#x4EF6;&#x7EC4;&#x6210;&#x3002;&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x5176;&#x4ED6;&#x5173;&#x4E8E;&#x9875;&#x9762;&#x7684;&#x6587;&#x6863;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x6267;&#x884C;&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; <code>navigator</code> &#x7EC4;&#x4EF6;&#x3002;&#x5F53;&#x63D2;&#x4EF6;&#x8DF3;&#x8F6C;&#x5230;&#x81EA;&#x8EAB;&#x9875;&#x9762;&#x65F6;&#xFF0C; <code>url</code> &#x5E94;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FD9;&#x6837;&#x7684;&#x5F62;&#x5F0F;&#xFF1A;<code>plugin-private://PLUGIN_APPID/PATH/TO/PAGE</code> &#x3002;&#x9700;&#x8981;&#x8DF3;&#x8F6C;&#x5230;&#x5176;&#x4ED6;&#x63D2;&#x4EF6;&#x65F6;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x6837;&#x8BBE;&#x7F6E; <code>url</code> &#x3002;</p>
<p><strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</strong></p>
<pre><code class="language-html"><span class="hljs-tag">&lt;<span class="hljs-name">navigator</span> <span class="hljs-attr">url</span>=<span class="hljs-string">&quot;plugin-private://wxidxxxxxxxxxxxxxx/pages/hello-page&quot;</span>&gt;</span>
  Go to pages/hello-page!
<span class="hljs-tag">&lt;/<span class="hljs-name">navigator</span>&gt;</span>
</code></pre>
<p>&#x81EA;&#x57FA;&#x7840;&#x5E93;&#x7248;&#x672C; <a href="../compatibility.html" title="&#x57FA;&#x7840;&#x5E93; 2.2.2 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x9700;&#x505A;&#x517C;&#x5BB9;&#x5904;&#x7406;&#x3002;">2.2.2</a> &#x5F00;&#x59CB;&#xFF0C;&#x5728;&#x63D2;&#x4EF6;&#x81EA;&#x8EAB;&#x7684;&#x9875;&#x9762;&#x4E2D;&#xFF0C;&#x63D2;&#x4EF6;&#x8FD8;&#x53EF;&#x4EE5;&#x8C03;&#x7528; <a href="../../api/wx.navigateTo.html"><code>wx.navigateTo</code></a> &#x6765;&#x8FDB;&#x884C;&#x9875;&#x9762;&#x8DF3;&#x8F6C;&#xFF0C; <code>url</code> &#x683C;&#x5F0F;&#x4E0E;&#x4F7F;&#x7528; <code>navigator</code> &#x7EC4;&#x4EF6;&#x65F6;&#x76F8;&#x4EFF;&#x3002;</p>
<h3 id="&#x63A5;&#x53E3;">&#x63A5;&#x53E3;</h3>
<p>&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x63A5;&#x53E3;&#x6587;&#x4EF6;&#xFF08;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#xFF0C;&#x8BE6;&#x60C5;&#x89C1;&#x4E0A;&#x6587;&#xFF09;&#x4E2D; export &#x4E00;&#x4E9B; js &#x63A5;&#x53E3;&#xFF0C;&#x4F9B;&#x63D2;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#xFF1A;</p>
<p><strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</strong></p>
<pre><code class="language-js"><span class="hljs-built_in">module</span>.exports = {
  hello() {
    <span class="hljs-built_in">console</span>.log(<span class="hljs-string">&apos;Hello plugin!&apos;</span>)
  }
}
</code></pre>
<h2 id="&#x9884;&#x89C8;&#x3001;&#x4E0A;&#x4F20;&#x548C;&#x53D1;&#x5E03;">&#x9884;&#x89C8;&#x3001;&#x4E0A;&#x4F20;&#x548C;&#x53D1;&#x5E03;</h2>
<p>&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x50CF;&#x5C0F;&#x7A0B;&#x5E8F;&#x4E00;&#x6837;&#x9884;&#x89C8;&#x548C;&#x4E0A;&#x4F20;&#xFF0C;&#x4F46;&#x63D2;&#x4EF6;&#x6CA1;&#x6709;&#x4F53;&#x9A8C;&#x7248;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x4F1A;&#x540C;&#x65F6;&#x6709;&#x591A;&#x4E2A;&#x7EBF;&#x4E0A;&#x7248;&#x672C;&#xFF0C;&#x7531;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x51B3;&#x5B9A;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x7684;&#x7248;&#x672C;&#x53F7;&#x3002;</p>
<p>&#x624B;&#x673A;&#x9884;&#x89C8;&#x548C;&#x63D0;&#x5BA1;&#x63D2;&#x4EF6;&#x65F6;&#xFF0C;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x6765;&#x5957;&#x7528;&#x9879;&#x76EE;&#x4E2D; <code>miniprogram</code> &#x6587;&#x4EF6;&#x5939;&#x4E0B;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x4ECE;&#x800C;&#x9884;&#x89C8;&#x63D2;&#x4EF6;&#x3002;</p>
<ul>
<li>&#xFF08;&#x5EFA;&#x8BAE;&#x7684;&#x65B9;&#x5F0F;&#xFF09;&#x5982;&#x679C;&#x5F53;&#x524D;&#x5F00;&#x53D1;&#x8005;&#x6709;<a href="../../devtools/sandbox.html">&#x6D4B;&#x8BD5;&#x53F7;</a>&#xFF0C;&#x5219;&#x4F1A;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x53F7;&#xFF1B;&#x5728;&#x6D4B;&#x8BD5;&#x53F7;&#x7684;&#x8BBE;&#x7F6E;&#x9875;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6D4B;&#x8BD5;&#x53F7;&#x7684; <code>appid</code> &#x3001; <code>appsecret</code> &#x5E76;&#x8BBE;&#x7F6E;&#x57DF;&#x540D;&#x5217;&#x8868;&#x3002;</li>
<li>&#x5426;&#x5219;&#xFF0C;&#x5C06;&#x4F7F;&#x7528;&#x201C;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x52A9;&#x624B;&#x201D;&#xFF0C;&#x5B83;&#x5177;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684; <code>appid</code> &#x3002;</li>
</ul>
<h2 id="&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;">&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;</h2>
<p>&#x5728;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x65F6;&#xFF0C;&#x63D2;&#x4EF6;&#x4EE3;&#x7801;&#x5E76;&#x4E0D;&#x53EF;&#x89C1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9664;&#x4E86;&#x63D2;&#x4EF6;&#x4EE3;&#x7801;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x652F;&#x6301;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x4E0A;&#x4F20;&#x4E00;&#x4EFD;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x3002;&#x8FD9;&#x4EFD;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x5C06;&#x5C55;&#x793A;&#x5728;&#x63D2;&#x4EF6;&#x8BE6;&#x60C5;&#x9875;&#xFF0C;&#x4F9B;&#x5176;&#x4ED6;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x6D4F;&#x89C8;&#x63D2;&#x4EF6;&#x548C;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x65F6;&#x8FDB;&#x884C;&#x9605;&#x8BFB;&#x548C;&#x53C2;&#x8003;&#x3002;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x5E94;&#x5728;&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x4E2D;&#x5BF9;&#x63D2;&#x4EF6;&#x63D0;&#x4F9B;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x3001;&#x9875;&#x9762;&#x3001;&#x63A5;&#x53E3;&#x7B49;&#x8FDB;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x63CF;&#x8FF0;&#x548C;&#x89E3;&#x91CA;&#xFF0C;&#x65B9;&#x4FBF;&#x7B2C;&#x4E09;&#x65B9;&#x5C0F;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x6587;&#x6863;&#x5FC5;&#x987B;&#x653E;&#x7F6E;&#x5728;&#x63D2;&#x4EF6;&#x9879;&#x76EE;&#x6839;&#x76EE;&#x5F55;&#x4E2D;&#x7684; <code>doc</code> &#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>doc
&#x251C;&#x2500;&#x2500; README.md   // &#x63D2;&#x4EF6;&#x6587;&#x6863;&#xFF0C;&#x5E94;&#x4E3A; markdown &#x683C;&#x5F0F;
&#x2514;&#x2500;&#x2500; picture.jpg // &#x5176;&#x4ED6;&#x8D44;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x4EC5;&#x652F;&#x6301;&#x56FE;&#x7247;
</code></pre>
<p>&#x5176;&#x4E2D;&#xFF0C;<code>README.md</code> &#x7684;&#x7F16;&#x5199;&#x6709;&#x4E00;&#x5B9A;&#x7684; <strong>&#x9650;&#x5236;&#x6761;&#x4EF6;</strong>&#xFF0C;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF1A;</p>
<ol>
<li>&#x5F15;&#x7528;&#x5230;&#x7684;&#x56FE;&#x7247;&#x8D44;&#x6E90;&#x4E0D;&#x80FD;&#x662F;&#x7F51;&#x7EDC;&#x56FE;&#x7247;&#xFF0C;&#x4E14;&#x5FC5;&#x987B;&#x653E;&#x5728;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E0B;&#xFF1B;</li>
<li>&#x6587;&#x6863;&#x4E2D;&#x7684;&#x94FE;&#x63A5;&#x53EA;&#x80FD;&#x94FE;&#x63A5;&#x5230;&#xFF1A;
<ul>
<li>&#x5FAE;&#x4FE1;&#x5F00;&#x53D1;&#x8005;&#x793E;&#x533A;&#xFF08;developers.weixin.qq.com&#xFF09;</li>
<li>&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x5E73;&#x53F0;&#xFF08;mp.weixin.qq.com&#xFF09;</li>
<li>GitHub&#xFF08;github.com&#xFF09;</li>
</ul>
</li>
</ol>
<p>&#x7F16;&#x8F91; <code>README.md</code> &#x4E4B;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x6253;&#x5F00; <code>README.md</code>&#xFF0C;&#x5E76;&#x5728;&#x7F16;&#x8F91;&#x5668;&#x7684;&#x53F3;&#x4E0B;&#x89D2;&#x9884;&#x89C8;&#x63D2;&#x4EF6;&#x6587;&#x6863;&#x548C;&#x5355;&#x72EC;&#x4E0A;&#x4F20;&#x63D2;&#x4EF6;&#x6587;&#x6863;&#x3002;&#x53D1;&#x5E03;&#x4E0A;&#x4F20;&#x6587;&#x6863;&#x540E;&#xFF0C;&#x6587;&#x6863;&#x4E0D;&#x4F1A;&#x7ACB;&#x523B;&#x53D1;&#x5E03;&#x3002;&#x6B64;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5E10;&#x53F7;&#x548C;&#x5BC6;&#x7801;&#x767B;&#x5F55; <a href="https://mp.weixin.qq.com" target="_blank">&#x7BA1;&#x7406;&#x540E;&#x53F0;</a> &#xFF0C;&#x5728; &#x5C0F;&#x7A0B;&#x5E8F;&#x63D2;&#x4EF6; &gt; &#x57FA;&#x672C;&#x8BBE;&#x7F6E; &#x4E2D;&#x9884;&#x89C8;&#x3001;&#x53D1;&#x5E03;&#x63D2;&#x4EF6;&#x6587;&#x6863;&#x3002;</p>
<h2 id="&#x5176;&#x4ED6;&#x6CE8;&#x610F;&#x4E8B;&#x9879;">&#x5176;&#x4ED6;&#x6CE8;&#x610F;&#x4E8B;&#x9879;</h2>
<h3 id="&#x63D2;&#x4EF6;&#x8BF7;&#x6C42;&#x7B7E;&#x540D;">&#x63D2;&#x4EF6;&#x8BF7;&#x6C42;&#x7B7E;&#x540D;</h3>
<p>&#x63D2;&#x4EF6;&#x5728;&#x4F7F;&#x7528; <a href="../../api/wx.request.html"><code>wx.request</code></a> &#x7B49; API &#x53D1;&#x9001;&#x7F51;&#x7EDC;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x989D;&#x5916;&#x643A;&#x5E26;&#x4E00;&#x4E2A;&#x7B7E;&#x540D; <code>HostSign</code> &#xFF0C;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x8BF7;&#x6C42;&#x6765;&#x6E90;&#x4E8E;&#x5C0F;&#x7A0B;&#x5E8F;&#x63D2;&#x4EF6;&#x3002;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x4F4D;&#x4E8E;&#x8BF7;&#x6C42;&#x5934;&#x4E2D;&#xFF0C;&#x5F62;&#x5982;&#xFF1A;</p>
<pre><code>X-WECHAT-HOSTSIGN: {&quot;noncestr&quot;:&quot;NONCESTR&quot;, &quot;timestamp&quot;:&quot;TIMESTAMP&quot;, &quot;signature&quot;:&quot;SIGNATURE&quot;}
</code></pre>
<p>&#x5176;&#x4E2D;&#xFF0C; <code>NONCESTR</code> &#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C; <code>TIMESTAMP</code> &#x662F;&#x751F;&#x6210;&#x8FD9;&#x4E2A;&#x968F;&#x673A;&#x5B57;&#x7B26;&#x4E32;&#x548C; <code>SIGNATURE</code> &#x7684; UNIX &#x65F6;&#x95F4;&#x6233;&#x3002;&#x5B83;&#x4EEC;&#x662F;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x7B7E;&#x540D; <code>SIGNATRUE</code> &#x7684;&#x53C2;&#x6570;&#xFF0C;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#x4E3A;&#xFF1A;</p>
<pre><code class="language-js">SIGNATURE = sha1([APPID, NONCESTR, TIMESTAMP, TOKEN].sort().join(<span class="hljs-string">&apos;&apos;</span>))
</code></pre>
<p>&#x5176;&#x4E2D;&#xFF0C;<code>APPID</code> &#x662F; <strong>&#x6240;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;</strong> &#x7684; AppId &#xFF08;&#x53EF;&#x4EE5;&#x4ECE;&#x8BF7;&#x6C42;&#x5934;&#x7684; <code>referrer</code> &#x4E2D;&#x83B7;&#x5F97;&#xFF09;&#xFF1B;<code>TOKEN</code> &#x662F;&#x63D2;&#x4EF6; Token&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x63D2;&#x4EF6;&#x57FA;&#x672C;&#x8BBE;&#x7F6E;&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x6309;&#x4EE5;&#x4E0B;&#x6B65;&#x9AA4;&#x6821;&#x9A8C;&#x7B7E;&#x540D;&#xFF1A;</p>
<ol>
<li><code>sort</code> &#x5BF9; <code>APPID</code> <code>NONCESTR</code> <code>TIMESTAMP</code> <code>TOKEN</code> &#x56DB;&#x4E2A;&#x503C;&#x8868;&#x793A;&#x6210;&#x5B57;&#x7B26;&#x4E32;&#x5F62;&#x5F0F;&#xFF0C;&#x6309;&#x7167;&#x5B57;&#x5178;&#x5E8F;&#x6392;&#x5E8F;&#xFF08;&#x540C; JavaScript &#x6570;&#x7EC4;&#x7684; sort &#x65B9;&#x6CD5;&#xFF09;&#xFF1B;</li>
<li><code>join</code> &#x5C06;&#x6392;&#x597D;&#x5E8F;&#x7684;&#x56DB;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#xFF1B;</li>
<li>&#x5BF9;&#x8FDE;&#x63A5;&#x7ED3;&#x679C;&#x4F7F;&#x7528; <code>sha1</code> &#x7B97;&#x6CD5;&#xFF0C;&#x5176;&#x7ED3;&#x679C;&#x5373; <code>SIGNATURE</code> &#x3002;</li>
</ol>
<p>&#x81EA;&#x57FA;&#x7840;&#x5E93;&#x7248;&#x672C; <a href="../compatibility.html" title="&#x57FA;&#x7840;&#x5E93; 2.0.7 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x9700;&#x505A;&#x517C;&#x5BB9;&#x5904;&#x7406;&#x3002;">2.0.7</a> &#x5F00;&#x59CB;&#xFF0C;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#xFF0C;&#x82E5;&#x7F51;&#x7EDC;&#x72B6;&#x51B5;&#x6B63;&#x5E38;&#xFF0C; <code>NONCESTR</code> &#x548C; <code>TIMESTAMP</code> &#x4F1A;&#x6BCF; 10 &#x5206;&#x949F;&#x53D8;&#x66F4;&#x4E00;&#x6B21;&#x3002;&#x5982;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5224;&#x65AD; <code>TIMESTAMP</code> &#x6765;&#x786E;&#x5B9A;&#x5F53;&#x524D;&#x7B7E;&#x540D;&#x662F;&#x5426;&#x4F9D;&#x65E7;&#x6709;&#x6548;&#x3002;</p>

                            </section>
                        </div>
                        
                    </div>
                
</body>
</html>
