<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>插件功能页</title>
  <link rel="stylesheet" href="../../style.css" />
  <link rel="stylesheet" href="../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;">&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;</h1>
<p>&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;&#x4ECE;&#x5C0F;&#x7A0B;&#x5E8F;&#x57FA;&#x7840;&#x5E93;&#x7248;&#x672C; <a href="../compatibility.html" title="&#x57FA;&#x7840;&#x5E93; 2.1.0 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x9700;&#x505A;&#x517C;&#x5BB9;&#x5904;&#x7406;&#x3002;">2.1.0</a> &#x5F00;&#x59CB;&#x652F;&#x6301;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8C03;&#x7528; <code>wx.login</code> &#x7B49;&#x8F83;&#x4E3A;&#x654F;&#x611F;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x5728;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x4E00;&#x4E9B;&#x654F;&#x611F;&#x63A5;&#x53E3;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#xFF1A;</p>
<ul>
<li>&#x83B7;&#x53D6;&#x7528;&#x6237;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC; <code>openid</code> &#x548C;&#x6635;&#x79F0;&#x7B49;&#xFF08;&#x76F8;&#x5F53;&#x4E8E; <code>wx.login</code> &#x548C; <code>wx.getUserInfo</code> &#x7684;&#x529F;&#x80FD;&#xFF09;&#x3002;</li>
<li>&#x652F;&#x4ED8;&#xFF08;&#x76F8;&#x5F53;&#x4E8E; <code>wx.requestPayment</code> &#xFF09;&#x3002;</li>
</ul>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;&#x63D2;&#x4EF6;&#x4F7F;&#x7528;&#x652F;&#x4ED8;&#x529F;&#x80FD;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x989D;&#x5916;&#x7684;&#x6743;&#x9650;&#x7533;&#x8BF7;&#xFF0C;&#x7533;&#x8BF7;&#x4F4D;&#x7F6E;&#x4F4D;&#x4E8E;<a href="https://mp.weixin.qq.com" target="_blank">&#x7BA1;&#x7406;&#x540E;&#x53F0;</a>&#x7684;&#x201C;&#x5C0F;&#x7A0B;&#x5E8F;&#x63D2;&#x4EF6; -&gt; &#x57FA;&#x672C;&#x8BBE;&#x7F6E; -&gt; &#x652F;&#x4ED8;&#x80FD;&#x529B;&#x201D;&#x8BBE;&#x7F6E;&#x9879;&#x4E2D;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x901A;&#x8FC7;&#x7533;&#x8BF7;&#xFF0C;&#x4E3B;&#x4F53;&#x4E3A;&#x4E2A;&#x4EBA;&#x5C0F;&#x7A0B;&#x5E8F;&#x5728;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x65F6;&#xFF0C;&#x90FD;&#x65E0;&#x6CD5;&#x6B63;&#x5E38;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x91CC;&#x7684;&#x652F;&#x4ED8;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5728;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x529F;&#x80FD;&#x9875;&#x65F6;&#xFF0C;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;&#x63D2;&#x4EF6;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x4E2D;&#x653E;&#x7F6E;&#x4E00;&#x4E2A; <code>&lt;functional-page-navigator&gt;</code> &#x7EC4;&#x4EF6;&#xFF0C;&#x7528;&#x6237;&#x5728;&#x70B9;&#x51FB;&#x8FD9;&#x4E2A;&#x7EC4;&#x4EF6;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x8DF3;&#x8F6C;&#x5230;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x6267;&#x884C;&#x767B;&#x5F55;&#x6216;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#x3002;</p>
<h2 id="&#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x9875;&#x7279;&#x6027;">&#x6FC0;&#x6D3B;&#x529F;&#x80FD;&#x9875;&#x7279;&#x6027;</h2>
<p>&#x529F;&#x80FD;&#x9875;&#x662F; <strong>&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;</strong> &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x9875;&#x9762;&#x3002;</p>
<p>&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x4E0E;&#x63D2;&#x4EF6; AppID &#x76F8;&#x540C;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x201C;&#x5C0F;&#x7A0B;&#x5E8F;&#x793A;&#x4F8B;&#x201D;&#x5C0F;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x5C0F;&#x7A0B;&#x5E8F;&#x793A;&#x4F8B;&#x63D2;&#x4EF6;&#x201D;&#xFF0C;&#x65E0;&#x8BBA;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x88AB;&#x54EA;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x7684;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x201C;&#x5C0F;&#x7A0B;&#x5E8F;&#x793A;&#x4F8B;&#x201D;&#x3002;</p>
<p>&#x542F;&#x7528;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F; <code>app.json</code> &#x6587;&#x4EF6;&#x4E2D;&#x6DFB;&#x52A0; <code>functionalPages</code> &#x5B9A;&#x4E49;&#x6BB5;&#xFF0C;&#x5176;&#x503C;&#x4E3A; <code>true</code> &#x3002;</p>
<pre><code class="lang-json">{
  <span class="hljs-string">&quot;functionalPages&quot;</span>: <span class="hljs-literal">true</span>
}
</code></pre>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x65B0;&#x589E;&#x6216;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x8FD9;&#x4E2A;&#x5C0F;&#x7A0B;&#x5E8F;&#x53D1;&#x5E03;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x6B63;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x4F7F;&#x7528;&#x63D2;&#x4EF6;&#x529F;&#x80FD;&#x9875;&#x3002;</p>
<h2 id="&#x8DF3;&#x8F6C;&#x5230;&#x529F;&#x80FD;&#x9875;">&#x8DF3;&#x8F6C;&#x5230;&#x529F;&#x80FD;&#x9875;</h2>
<p>&#x5728;&#x63D2;&#x4EF6;&#x9700;&#x8981;&#x767B;&#x5F55;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x63D2;&#x4EF6;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x7EC4;&#x4EF6;&#x4E2D;&#x653E;&#x7F6E;&#x4E00;&#x4E2A; <code>&lt;functional-page-navigator&gt;</code> &#x7EC4;&#x4EF6;&#x3002;</p>
<p><strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</strong></p>
<pre><code class="lang-html"><span class="hljs-tag">&lt;<span class="hljs-name">functional-page-navigator</span> <span class="hljs-attr">name</span>=<span class="hljs-string">&quot;loginAndGetUserInfo&quot;</span> <span class="hljs-attr">args</span>=<span class="hljs-string">&quot;&quot;</span> <span class="hljs-attr">version</span>=<span class="hljs-string">&quot;develop&quot;</span> <span class="hljs-attr">bind:success</span>=<span class="hljs-string">&quot;loginSuccess&quot;</span>&gt;</span>
  <span class="hljs-tag">&lt;<span class="hljs-name">button</span>&gt;</span>&#x767B;&#x5F55;&#x5230;&#x63D2;&#x4EF6;<span class="hljs-tag">&lt;/<span class="hljs-name">button</span>&gt;</span>
<span class="hljs-tag">&lt;/<span class="hljs-name">functional-page-navigator</span>&gt;</span>
</code></pre>
<p>&#x7528;&#x6237;&#x5728;&#x70B9;&#x51FB;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x65F6;&#xFF0C;&#x4F1A;&#x81EA;&#x52A8;&#x8DF3;&#x8F6C;&#x5230;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x9875;&#x3002;&#x529F;&#x80FD;&#x9875;&#x4F1A;&#x63D0;&#x793A;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x767B;&#x5F55;&#x6216;&#x5176;&#x4ED6;&#x76F8;&#x5E94;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x64CD;&#x4F5C;&#x7ED3;&#x679C;&#x4F1A;&#x4EE5;&#x7EC4;&#x4EF6;&#x4E8B;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7528;&#x6CD5;&#x548C;&#x652F;&#x6301;&#x7684;&#x529F;&#x80FD;&#x9875;&#x5217;&#x8868;&#x8BE6;&#x89C1; <a href="../../component/functional-page-navigator.html">&#x7EC4;&#x4EF6;&#x8BF4;&#x660E;</a> &#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;&#x529F;&#x80FD;&#x9875;&#x7684;&#x8DF3;&#x8F6C;&#x76EE;&#x524D;&#x4E0D;&#x652F;&#x6301;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x5DE5;&#x5177;&#x4E2D;&#x8C03;&#x8BD5;&#xFF0C;&#x8BF7;&#x5728;&#x771F;&#x673A;&#x4E0A;&#x6D4B;&#x8BD5;&#x3002;</p>
<h2 id="&#x529F;&#x80FD;&#x9875;&#x51FD;&#x6570;">&#x529F;&#x80FD;&#x9875;&#x51FD;&#x6570;</h2>
<p>&#x5728;&#x4F7F;&#x7528;&#x652F;&#x4ED8;&#x529F;&#x80FD;&#x9875;&#x65F6;&#xFF0C;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x6765;&#x54CD;&#x5E94;&#x652F;&#x4ED8;&#x8BF7;&#x6C42;&#x3002;&#x8FD9;&#x4E2A;&#x54CD;&#x5E94;&#x51FD;&#x6570;&#x5E94;&#x5F53;&#x5199;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x6839;&#x76EE;&#x5F55;&#x4E2D;&#x7684; <code>functional-pages/request-payment.js</code> &#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x540D;&#x4E3A; <code>beforeRequestPayment</code> &#x3002;&#x5982;&#x679C;&#x4E0D;&#x63D0;&#x4F9B;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x5C06;&#x901A;&#x8FC7; fail &#x4E8B;&#x4EF6;&#x8FD4;&#x56DE;&#x5931;&#x8D25;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;&#x529F;&#x80FD;&#x9875;&#x51FD;&#x6570;&#x4E0D;&#x5E94; require &#x5176;&#x4ED6;&#x975E; functional-pages &#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x5176;&#x4ED6;&#x975E; functional-pages &#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x4E5F;&#x4E0D;&#x5E94; require &#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x4E2D;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x7684; require &#x8C03;&#x7528;&#x5728;&#x672A;&#x6765;&#x5C06;&#x4E0D;&#x88AB;&#x652F;&#x6301;&#x3002;</strong></p>
<p><strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF1A;</strong></p>
<pre><code class="lang-js"><span class="hljs-comment">// functional-pages/request-payment.js</span>
exports.beforeRequestPayment = <span class="hljs-function"><span class="hljs-keyword">function</span>(<span class="hljs-params">paymentArgs, callback</span>) </span>{
  paymentArgs <span class="hljs-comment">// &#x5C31;&#x662F; functional-page-navigator &#x7684; args &#x5C5E;&#x6027;&#x4E2D; paymentArgs</span>

  <span class="hljs-comment">// &#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x652F;&#x4ED8;&#x524D;&#x7684;&#x53C2;&#x6570;&#x5904;&#x7406;&#x903B;&#x8F91;&#xFF0C;&#x5305;&#x62EC;&#x901A;&#x77E5;&#x540E;&#x53F0;&#x8C03;&#x7528;&#x7EDF;&#x4E00;&#x4E0B;&#x5355;&#x63A5;&#x53E3;</span>

  <span class="hljs-comment">// &#x5728; callback &#x4E2D;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A; err &#x548C; requestPaymentArgs</span>
  <span class="hljs-comment">// err &#x5E94;&#x4E3A; null &#xFF08;&#x6216;&#x8005;&#x4E00;&#x4E9B;&#x5931;&#x8D25;&#x4FE1;&#x606F;&#xFF09;</span>
  <span class="hljs-comment">// requestPaymentArgs &#x5C06;&#x88AB;&#x7528;&#x4E8E;&#x8C03;&#x7528; wx.requestPayment</span>
  callback(<span class="hljs-literal">null</span>, {
    <span class="hljs-comment">// &#x8FD9;&#x91CC;&#x7684;&#x53C2;&#x6570;&#x4E0E; wx.requestPayment &#x76F8;&#x540C;&#xFF0C;&#x9664;&#x4E86; success/fail/complete &#x4E0D;&#x88AB;&#x652F;&#x6301;</span>
    timeStamp: timeStamp,
    nonceStr: nonceStr,
    package: package,
    signType: signType,
    paySign: paySign,
  })
}
</code></pre>
<p><strong>&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x548C;&#x6587;&#x4EF6;&#x5E94;&#x5F53;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#xFF08;&#x800C;&#x975E;&#x63D2;&#x4EF6;&#x4EE3;&#x7801;&#x4E2D;&#xFF09;&#xFF0C;&#x5B83;&#x662F;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF08;&#x800C;&#x975E;&#x63D2;&#x4EF6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF09;&#x3002;</strong> &#x5982;&#x679C;&#x9700;&#x8981;&#x65B0;&#x589E;&#x6216;&#x66F4;&#x6539;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x9700;&#x8981;&#x53D1;&#x5E03;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x6B63;&#x5F0F;&#x7248;&#x4E2D;&#x751F;&#x6548;&#xFF1B;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x9884;&#x89C8;&#x63D2;&#x4EF6;&#x6240;&#x6709;&#x8005;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;&#x624D;&#x80FD;&#x5728;&#x5F00;&#x53D1;&#x7248;&#x4E2D;&#x751F;&#x6548;&#x3002;</p>
<h4 id="bugs--tips">Bugs &amp; Tips</h4>
<ul>
<li>Bug&#xFF1A;&#x5728;&#x5FAE;&#x4FE1;&#x7248;&#x672C; 6.6.7 &#x4E2D;&#xFF0C;&#x529F;&#x80FD;&#x9875;&#x88AB;&#x62C9;&#x8D77;&#x65F6;&#x4F1A;&#x89E6;&#x53D1; App &#x7684;&#x90E8;&#x5206;&#x751F;&#x547D;&#x5468;&#x671F;&#x5E76;&#x4F7F;&#x5F97;&#x529F;&#x80FD;&#x9875;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x53D8;&#x5F97;&#x6BD4;&#x8F83;&#x957F;&#x3002;&#x5728;&#x540E;&#x7EED;&#x7684;&#x5FAE;&#x4FE1;&#x7248;&#x672C;&#x4E2D;&#x8FD9;&#x4E00;&#x884C;&#x4E3A;&#x4F1A;&#x53D1;&#x751F;&#x53D8;&#x66F4;&#xFF0C;&#x4F7F; App &#x751F;&#x547D;&#x5468;&#x671F;&#x4E0D;&#x518D;&#x88AB;&#x89E6;&#x53D1;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    
</div>

                        
</body>
</html>
