<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>转发</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                                <h2 id="&#x8F6C;&#x53D1;">&#x8F6C;&#x53D1;</h2>
<h4 id="&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x8F6C;&#x53D1;&#x4FE1;&#x606F;">&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x8F6C;&#x53D1;&#x4FE1;&#x606F;</h4>
<p>&#x901A;&#x5E38;&#x5F00;&#x53D1;&#x8005;&#x5E0C;&#x671B;&#x8F6C;&#x53D1;&#x51FA;&#x53BB;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x88AB;&#x4E8C;&#x6B21;&#x6253;&#x5F00;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x591F;&#x83B7;&#x53D6;&#x5230;&#x4E00;&#x4E9B;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x7FA4;&#x7684;&#x6807;&#x8BC6;&#x3002;&#x73B0;&#x5728;&#x901A;&#x8FC7;&#x8C03;&#x7528; <code>wx.showShareMenu</code> &#x5E76;&#x4E14;&#x8BBE;&#x7F6E; <code>withShareTicket</code> &#x4E3A; <code>true</code> &#xFF0C;&#x5F53;&#x7528;&#x6237;&#x5C06;&#x5C0F;&#x7A0B;&#x5E8F;&#x8F6C;&#x53D1;&#x5230;&#x4EFB;&#x4E00;&#x7FA4;&#x804A;&#x4E4B;&#x540E;&#xFF0C;&#x6B64;&#x8F6C;&#x53D1;&#x5361;&#x7247;&#x5728;&#x7FA4;&#x804A;&#x4E2D;&#x88AB;&#x5176;&#x4ED6;&#x7528;&#x6237;&#x6253;&#x5F00;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5728; <a href="../app-service/app.html">App.onLaunch</a> &#x6216; <a href="../app-service/app.html">App.onShow</a>  &#x83B7;&#x53D6;&#x5230;&#x4E00;&#x4E2A; <code>shareTicket</code>&#x3002;&#x901A;&#x8FC7;&#x8C03;&#x7528; <a href="../../api/share/wx.getShareInfo.html">wx.getShareInfo()</a> &#x63A5;&#x53E3;&#x4F20;&#x5165;&#x6B64; <code>shareTicket</code> &#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230;&#x8F6C;&#x53D1;&#x4FE1;&#x606F;&#x3002;</p>
<h4 id="&#x9875;&#x9762;&#x5185;&#x53D1;&#x8D77;&#x8F6C;&#x53D1;">&#x9875;&#x9762;&#x5185;&#x53D1;&#x8D77;&#x8F6C;&#x53D1;</h4>
<blockquote>
<p>&#x57FA;&#x7840;&#x5E93; 1.2.0 &#x5F00;&#x59CB;&#x652F;&#x6301;&#xFF0C;&#x4F4E;&#x7248;&#x672C;&#x9700;&#x505A;<a href="../compatibility.html">&#x517C;&#x5BB9;&#x5904;&#x7406;</a>&#x3002;</p>
</blockquote>
<p>&#x901A;&#x8FC7;&#x7ED9; <code>button</code> &#x7EC4;&#x4EF6;&#x8BBE;&#x7F6E;&#x5C5E;&#x6027; <code>open-type=&quot;share&quot;</code>&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7528;&#x6237;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x540E;&#x89E6;&#x53D1; <a href="../app-service/page.html#onshareappmessageobject"><code>Page.onShareAppMessage</code></a> &#x4E8B;&#x4EF6;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x9875;&#x9762;&#x6CA1;&#x6709;&#x5B9A;&#x4E49;&#x6B64;&#x4E8B;&#x4EF6;&#xFF0C;&#x5219;&#x70B9;&#x51FB;&#x540E;&#x65E0;&#x6548;&#x679C;&#x3002;&#x76F8;&#x5173;&#x7EC4;&#x4EF6;&#xFF1A;<a href="../../component/button.html">button</a></p>
<h4 id="&#x4F7F;&#x7528;&#x6307;&#x5F15;">&#x4F7F;&#x7528;&#x6307;&#x5F15;</h4>
<p>&#x8F6C;&#x53D1;&#x6309;&#x94AE;&#xFF0C;&#x65E8;&#x5728;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x66F4;&#x6D41;&#x7545;&#x5730;&#x4E0E;&#x597D;&#x53CB;&#x5206;&#x4EAB;&#x5185;&#x5BB9;&#x548C;&#x670D;&#x52A1;&#x3002;&#x8F6C;&#x53D1;&#xFF0C;&#x5E94;&#x662F;&#x7528;&#x6237;&#x81EA;&#x53D1;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x4E14;&#x5728;&#x9700;&#x8981;&#x65F6;&#x89E6;&#x624B;&#x53EF;&#x53CA;&#x3002;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x4F7F;&#x7528;&#x65F6;&#x82E5;&#x9075;&#x4ECE;&#x4EE5;&#x4E0B;&#x6307;&#x5F15;&#xFF0C;&#x4F1A;&#x5F97;&#x5230;&#x66F4;&#x4F73;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<ol>
<li>&#x542B;&#x4E49;&#x6E05;&#x6670;&#xFF1A;&#x660E;&#x786E;&#x3001;&#x4E00;&#x76EE;&#x4E86;&#x7136;&#x7684;&#x56FE;&#x5F62;&#x6309;&#x94AE;&#xFF0C;&#x5C06;&#x4E3A;&#x7528;&#x6237;&#x51CF;&#x5C11;&#x7406;&#x89E3;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x7684;&#x8D44;&#x6E90;&#x4E0B;&#x8F7D;&#x4E2D;&#x5FC3;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x6309;&#x94AE;&#x7D20;&#x6750;&#x5E76;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x3002;&#x6216;&#x8005;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x4E1A;&#x52A1;&#x7684;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#xFF0C;&#x7075;&#x6D3B;&#x8BBE;&#x8BA1;&#x542B;&#x4E49;&#x6E05;&#x6670;&#x7684;&#x6309;&#x94AE;&#x7684;&#x6837;&#x5F0F;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5E26;&#x6587;&#x6848;&#x7684;&#x6309;&#x94AE;&#xFF0C;&#x201C;&#x8F6C;&#x53D1;&#x7ED9;&#x597D;&#x53CB;&#x201D;&#xFF0C;&#x5B83;&#x4E5F;&#x8DB3;&#x591F;&#x660E;&#x786E;&#x3002;</li>
<li>&#x65B9;&#x4FBF;&#x70B9;&#x51FB;&#xFF1A;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x70ED;&#x533A;&#x4E0D;&#x5B9C;&#x8FC7;&#x5C0F;&#xFF0C;&#x4EA6;&#x4E0D;&#x5B9C;&#x8FC7;&#x5927;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8F6C;&#x53D1;&#x6309;&#x94AE;&#x4E0E;&#x5176;&#x4ED6;&#x6309;&#x94AE;&#x4E00;&#x6837;&#xFF0C;&#x70ED;&#x533A;&#x4E5F;&#x4E0D;&#x5B9C;&#x8FC7;&#x5BC6;&#xFF0C;&#x4EE5;&#x514D;&#x7528;&#x6237;&#x8BEF;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x6309;&#x9700;&#x51FA;&#x73B0;&#xFF1A;&#x5E76;&#x975E;&#x6240;&#x6709;&#x9875;&#x9762;&#x90FD;&#x9002;&#x5408;&#x653E;&#x7F6E;&#x8F6C;&#x53D1;&#x6309;&#x94AE;&#xFF0C;&#x6D89;&#x53CA;&#x7528;&#x6237;&#x9690;&#x79C1;&#x7684;&#x975E;&#x516C;&#x5F00;&#x5185;&#x5BB9;&#xFF0C;&#x6216;&#x53EF;&#x80FD;&#x6253;&#x65AD;&#x7528;&#x6237;&#x5B8C;&#x6210;&#x5F53;&#x524D;&#x64CD;&#x4F5C;&#x4F53;&#x9A8C;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x8BE5;&#x529F;&#x80FD;&#x5E76;&#x4E0D;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x8F6C;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x622A;&#x53D6;&#x7528;&#x6237;&#x5C4F;&#x5E55;&#x56FE;&#x50CF;&#x4F5C;&#x4E3A;&#x914D;&#x56FE;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x5E2E;&#x52A9;&#x7528;&#x6237;&#x5C4F;&#x853D;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3002;</li>
<li>&#x5C0A;&#x91CD;&#x610F;&#x613F;&#xFF1A;&#x7406;&#x6240;&#x5F53;&#x7136;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x7528;&#x6237;&#xFF0C;&#x90FD;&#x559C;&#x6B22;&#x4E0E;&#x670B;&#x53CB;&#x5206;&#x4EAB;&#x4F60;&#x7684;&#x5C0F;&#x7A0B;&#x5E8F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x8BF1;&#x5BFC;&#x6216;&#x5F3A;&#x5236;&#x884C;&#x4E3A;&#xFF0C;&#x5982;&#x8F6C;&#x53D1;&#x540E;&#x624D;&#x80FD;&#x89E3;&#x9501;&#x67D0;&#x9879;&#x529F;&#x80FD;&#x7B49;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x7C7B;&#x505A;&#x6CD5;&#x4E0D;&#x4EC5;&#x4E0D;&#x88AB;&#x63A8;&#x8350;&#xFF0C;&#x8FD8;&#x53EF;&#x80FD;&#x8FDD;&#x53CD;&#x6211;&#x4EEC;&#x7684;<a href="https://mp.weixin.qq.com/debug/wxadoc/product/index.html?t=18092019">&#x300A;&#x8FD0;&#x8425;&#x89C4;&#x8303;&#x300B;</a>&#xFF0C;&#x6211;&#x4EEC;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F60;&#x5728;&#x4F7F;&#x7528;&#x524D;&#x9605;&#x8BFB;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#xFF0C;&#x6211;&#x4EEC;&#x9648;&#x5217;&#x4E86;&#x6700;&#x91CD;&#x8981;&#x7684;&#x51E0;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x5B8C;&#x6574;&#x6D4F;&#x89C8;<a href="https://mp.weixin.qq.com/debug/wxadoc/design/index.html?t=18092019">&#x300A;&#x8BBE;&#x8BA1;&#x6307;&#x5357;&#x300B;</a>&#xFF0C;&#x76F8;&#x4FE1;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x6536;&#x83B7;&#x3002;</p>
<h4 id="tips">Tips</h4>
<ol>
<li>&#x4E0D;&#x81EA;&#x5B9A;&#x4E49;&#x8F6C;&#x53D1;&#x56FE;&#x7247;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9ED8;&#x8BA4;&#x4F1A;&#x53D6;&#x5F53;&#x524D;&#x9875;&#x9762;&#xFF0C;&#x4ECE;&#x9876;&#x90E8;&#x5F00;&#x59CB;&#xFF0C;&#x9AD8;&#x5EA6;&#x4E3A; 80% &#x5C4F;&#x5E55;&#x5BBD;&#x5EA6;&#x7684;&#x56FE;&#x50CF;&#x4F5C;&#x4E3A;&#x8F6C;&#x53D1;&#x56FE;&#x7247;&#x3002;</li>
<li>&#x8F6C;&#x53D1;&#x7684;&#x8C03;&#x8BD5;&#x652F;&#x6301;&#x8BF7;&#x67E5;&#x770B; <a href="../../devtools/different.html#&#x666E;&#x901A;&#x7684;&#x8F6C;&#x53D1;">&#x666E;&#x901A;&#x8F6C;&#x53D1;&#x7684;&#x8C03;&#x8BD5;&#x652F;&#x6301;</a> &#x548C; <a href="../../devtools/different.html#&#x5E26;-shareticket-&#x7684;&#x8F6C;&#x53D1;">&#x5E26; shareTicket &#x7684;&#x8F6C;&#x53D1;</a></li>
<li>&#x53EA;&#x6709;&#x8F6C;&#x53D1;&#x5230;&#x7FA4;&#x804A;&#x4E2D;&#x6253;&#x5F00;&#x624D;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x5230; <code>shareTickets</code> &#x8FD4;&#x56DE;&#x503C;&#xFF0C;&#x5355;&#x804A;&#x6CA1;&#x6709; <code>shareTickets</code></li>
<li><code>shareTicket</code> &#x4EC5;&#x5728;&#x5F53;&#x524D;&#x5C0F;&#x7A0B;&#x5E8F;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x6709;&#x6548;</li>
<li>&#x7531;&#x4E8E;&#x7B56;&#x7565;&#x53D8;&#x52A8;&#xFF0C;&#x5C0F;&#x7A0B;&#x5E8F;&#x7FA4;&#x76F8;&#x5173;&#x80FD;&#x529B;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x5148;&#x4F7F;&#x7528; <code>wx.getShareInfo</code> &#x63A5;&#x53E3;&#x4E2D;&#x7684;&#x7FA4;ID&#x8FDB;&#x884C;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x3002;</li>
</ol>

                            </section>      
                        </div>
                        
                    </div>
                
</body>
</html>
