<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>模板消息</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                              <h2 id="&#x6A21;&#x677F;&#x6D88;&#x606F;">&#x6A21;&#x677F;&#x6D88;&#x606F;</h2>
<blockquote>
<p>&#x5FAE;&#x4FE1;6.5.2&#x53CA;&#x4EE5;&#x4E0A;&#x7248;&#x672C;&#x652F;&#x6301;</p>
</blockquote>
<p>&#x57FA;&#x4E8E;&#x5FAE;&#x4FE1;&#x7684;&#x901A;&#x77E5;&#x6E20;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x53EF;&#x4EE5;&#x9AD8;&#x6548;&#x89E6;&#x8FBE;&#x7528;&#x6237;&#x7684;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x80FD;&#x529B;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B9E;&#x73B0;&#x670D;&#x52A1;&#x7684;&#x95ED;&#x73AF;&#x5E76;&#x63D0;&#x4F9B;&#x66F4;&#x4F73;&#x7684;&#x4F53;&#x9A8C;&#x3002;</p>
<ul>
<li>&#x6A21;&#x677F;&#x63A8;&#x9001;&#x4F4D;&#x7F6E;&#xFF1A;&#x670D;&#x52A1;&#x901A;&#x77E5;</li>
<li>&#x6A21;&#x677F;&#x4E0B;&#x53D1;&#x6761;&#x4EF6;&#xFF1A;&#x7528;&#x6237;&#x672C;&#x4EBA;&#x5728;&#x5FAE;&#x4FE1;&#x4F53;&#x7CFB;&#x5185;&#x4E0E;&#x9875;&#x9762;&#x6709;&#x4EA4;&#x4E92;&#x884C;&#x4E3A;&#x540E;&#x89E6;&#x53D1;&#xFF0C;&#x8BE6;&#x89C1; <a href="#&#x4E0B;&#x53D1;&#x6761;&#x4EF6;&#x8BF4;&#x660E;">&#x4E0B;&#x53D1;&#x6761;&#x4EF6;&#x8BF4;&#x660E;</a></li>
<li>&#x6A21;&#x677F;&#x8DF3;&#x8F6C;&#x80FD;&#x529B;&#xFF1A;&#x70B9;&#x51FB;&#x67E5;&#x770B;&#x8BE6;&#x60C5;&#x4EC5;&#x80FD;&#x8DF3;&#x8F6C;&#x4E0B;&#x53D1;&#x6A21;&#x677F;&#x7684;&#x8BE5;&#x5E10;&#x53F7;&#x7684;&#x5404;&#x4E2A;&#x9875;&#x9762;</li>
</ul>
<h3 id="&#x4F7F;&#x7528;&#x8BF4;&#x660E;">&#x4F7F;&#x7528;&#x8BF4;&#x660E;</h3>
<h5 id="&#x6B65;&#x9AA4;&#x4E00;&#xFF1A;&#x83B7;&#x53D6;&#x6A21;&#x677F;-id">&#x6B65;&#x9AA4;&#x4E00;&#xFF1A;&#x83B7;&#x53D6;&#x6A21;&#x677F; ID</h5>
<p>&#x6709;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x6A21;&#x677F; ID&#xFF1A;</p>
<ol>
<li>&#x901A;&#x8FC7;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7BA1;&#x7406;&#x63A5;&#x53E3;&#x83B7;&#x53D6;&#x6A21;&#x677F; ID&#xFF08;&#x8BE6;&#x89C1; <a href="#&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7BA1;&#x7406;">&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7BA1;&#x7406;</a>&#xFF09;</li>
<li>&#x5728;&#x5FAE;&#x4FE1;&#x516C;&#x4F17;&#x5E73;&#x53F0;&#x624B;&#x52A8;&#x914D;&#x7F6E;&#x83B7;&#x53D6;&#x6A21;&#x677F; ID</li>
</ol>
<p>&#x767B;&#x5F55; https://mp.weixin.qq.com &#x83B7;&#x53D6;&#x6A21;&#x677F;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x6A21;&#x677F;&#xFF0C;&#x53EF;&#x4EE5;&#x7533;&#x8BF7;&#x6DFB;&#x52A0;&#x65B0;&#x6A21;&#x677F;&#xFF0C;&#x5BA1;&#x6838;&#x901A;&#x8FC7;&#x540E;&#x53EF;&#x4F7F;&#x7528;&#xFF0C;&#x8BE6;&#x89C1; <a href="#&#x5BA1;&#x6838;&#x8BF4;&#x660E;">&#x6A21;&#x677F;&#x5BA1;&#x6838;&#x8BF4;&#x660E;</a></p>
<p><img src="https://developers.weixin.qq.com/miniprogram/dev/framework/open-ability/image/mp-notice.jpg?t=19012813" alt="" onerror="this.src !== &apos;./image/mp-notice.jpg?t=19012813&apos; &amp;&amp; (this.src = &apos;./image/mp-notice.jpg?t=19012813&apos;)"></p>
<h5 id="&#x6B65;&#x9AA4;&#x4E8C;&#xFF1A;&#x9875;&#x9762;&#x7684;-form-&#x7EC4;&#x4EF6;&#xFF0C;&#x5C5E;&#x6027;-report-submit-&#x4E3A;-true-&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x4E3A;&#x9700;&#x8981;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF0C;&#x6B64;&#x65F6;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;-formid&#xFF0C;&#x7528;&#x4E8E;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x3002;&#x6216;&#x8005;&#x5F53;&#x7528;&#x6237;&#x5B8C;&#x6210;-&#x652F;&#x4ED8;&#x884C;&#x4E3A;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;-prepayid-&#x7528;&#x4E8E;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x3002;">&#x6B65;&#x9AA4;&#x4E8C;&#xFF1A;&#x9875;&#x9762;&#x7684; <a href="../../component/form.html"><code>&lt;form/&gt;</code></a> &#x7EC4;&#x4EF6;&#xFF0C;&#x5C5E;&#x6027; <code>report-submit</code> &#x4E3A; <code>true</code> &#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x4E3A;&#x9700;&#x8981;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF0C;&#x6B64;&#x65F6;&#x70B9;&#x51FB;&#x6309;&#x94AE;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x53EF;&#x4EE5;&#x83B7;&#x53D6; <code>formId</code>&#xFF0C;&#x7528;&#x4E8E;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x3002;&#x6216;&#x8005;&#x5F53;&#x7528;&#x6237;&#x5B8C;&#x6210; <a href="../../api/wx.requestPayment.html">&#x652F;&#x4ED8;&#x884C;&#x4E3A;</a>&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x53D6; <code>prepay_id</code> &#x7528;&#x4E8E;&#x53D1;&#x9001;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x3002;</h5>
<h5 id="&#x6B65;&#x9AA4;&#x4E09;&#xFF1A;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#x4E0B;&#x53D1;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF08;&#x8BE6;&#x89C1;-sendtemplatemessage-&#xFF09;">&#x6B65;&#x9AA4;&#x4E09;&#xFF1A;&#x8C03;&#x7528;&#x63A5;&#x53E3;&#x4E0B;&#x53D1;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF08;&#x8BE6;&#x89C1; <a href="../../api/sendTemplateMessage.html">sendTemplateMessage</a> &#xFF09;</h5>
<p><strong>&#x4F7F;&#x7528;&#x6548;&#x679C;</strong></p>
<p><img src="https://developers.weixin.qq.com/miniprogram/dev/framework/open-ability/image/notice.png?t=19012813" alt="" onerror="this.src !== &apos;./image/notice.png?t=19012813&apos; &amp;&amp; (this.src = &apos;./image/notice.png?t=19012813&apos;)"></p>
<h3 id="&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7BA1;&#x7406;">&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7BA1;&#x7406;</h3>
<ol>
<li><a href="../../api/getTemplateLibraryList.html">&#x83B7;&#x53D6;&#x5C0F;&#x7A0B;&#x5E8F;&#x6A21;&#x677F;&#x5E93;&#x6807;&#x9898;&#x5217;&#x8868;</a></li>
<li><a href="../../api/getTemplateLibraryById.html">&#x83B7;&#x53D6;&#x6A21;&#x677F;&#x5E93;&#x67D0;&#x4E2A;&#x6A21;&#x677F;&#x6807;&#x9898;&#x4E0B;&#x5173;&#x952E;&#x8BCD;&#x5E93;</a></li>
<li><a href="../../api/addTemplate.html">&#x7EC4;&#x5408;&#x6A21;&#x677F;&#x5E76;&#x6DFB;&#x52A0;&#x81F3;&#x5E10;&#x53F7;&#x4E0B;&#x7684;&#x4E2A;&#x4EBA;&#x6A21;&#x677F;&#x5E93;</a></li>
<li><a href="../../api/getTemplateList.html">&#x83B7;&#x53D6;&#x5E10;&#x53F7;&#x4E0B;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x6A21;&#x677F;&#x5217;&#x8868;</a></li>
<li><a href="../../api/deleteTemplate.html">&#x5220;&#x9664;&#x5E10;&#x53F7;&#x4E0B;&#x7684;&#x67D0;&#x4E2A;&#x6A21;&#x677F;</a></li>
</ol>
<h3 id="&#x4E0B;&#x53D1;&#x6761;&#x4EF6;&#x8BF4;&#x660E;">&#x4E0B;&#x53D1;&#x6761;&#x4EF6;&#x8BF4;&#x660E;</h3>
<h4 id="1-&#x652F;&#x4ED8;">1. &#x652F;&#x4ED8;</h4>
<p>&#x5F53;&#x7528;&#x6237;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x5185;&#x5B8C;&#x6210;&#x8FC7;&#x652F;&#x4ED8;&#x884C;&#x4E3A;&#xFF0C;&#x53EF;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x8005;&#x5411;&#x7528;&#x6237;&#x5728;7&#x5929;&#x5185;&#x63A8;&#x9001;&#x6709;&#x9650;&#x6761;&#x6570;&#x7684;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF08;1&#x6B21;&#x652F;&#x4ED8;&#x53EF;&#x4E0B;&#x53D1;3&#x6761;&#xFF0C;&#x591A;&#x6B21;&#x652F;&#x4ED8;&#x4E0B;&#x53D1;&#x6761;&#x6570;&#x72EC;&#x7ACB;&#xFF0C;&#x4E92;&#x76F8;&#x4E0D;&#x5F71;&#x54CD;&#xFF09;</p>
<h4 id="2-&#x63D0;&#x4EA4;&#x8868;&#x5355;">2. &#x63D0;&#x4EA4;&#x8868;&#x5355;</h4>
<p>&#x5F53;&#x7528;&#x6237;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x5185;&#x53D1;&#x751F;&#x8FC7;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x884C;&#x4E3A;&#x4E14;&#x8BE5;&#x8868;&#x5355;&#x58F0;&#x660E;&#x4E3A;&#x8981;&#x53D1;&#x6A21;&#x677F;&#x6D88;&#x606F;&#x7684;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x5411;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x53EF;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x8005;&#x5411;&#x7528;&#x6237;&#x5728;7&#x5929;&#x5185;&#x63A8;&#x9001;&#x6709;&#x9650;&#x6761;&#x6570;&#x7684;&#x6A21;&#x677F;&#x6D88;&#x606F;&#xFF08;1&#x6B21;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x53EF;&#x4E0B;&#x53D1;1&#x6761;&#xFF0C;&#x591A;&#x6B21;&#x63D0;&#x4EA4;&#x4E0B;&#x53D1;&#x6761;&#x6570;&#x72EC;&#x7ACB;&#xFF0C;&#x76F8;&#x4E92;&#x4E0D;&#x5F71;&#x54CD;&#xFF09;</p>
<h3 id="&#x5BA1;&#x6838;&#x8BF4;&#x660E;">&#x5BA1;&#x6838;&#x8BF4;&#x660E;</h3>
<ol>
<li>&#x6807;&#x9898;
<ol>
<li>&#x6807;&#x9898;&#x4E0D;&#x80FD;&#x5B58;&#x5728;&#x76F8;&#x540C;</li>
<li>&#x6807;&#x9898;&#x610F;&#x601D;&#x4E0D;&#x80FD;&#x5B58;&#x5728;&#x8FC7;&#x5EA6;&#x76F8;&#x4F3C;</li>
<li>&#x6807;&#x9898;&#x5FC5;&#x987B;&#x4EE5;&#x201C;&#x63D0;&#x9192;&#x201D;&#x6216;&#x201C;&#x901A;&#x77E5;&#x201D;&#x7ED3;&#x5C3E;</li>
<li>&#x6807;&#x9898;&#x4E0D;&#x80FD;&#x5E26;&#x7279;&#x6B8A;&#x7B26;&#x53F7;&#x3001;&#x4E2A;&#x6027;&#x5316;&#x5B57;&#x8BCD;&#x7B49;&#x6CA1;&#x6709;&#x884C;&#x4E1A;&#x901A;&#x7528;&#x6027;&#x7684;&#x5185;&#x5BB9;</li>
<li>&#x6807;&#x9898;&#x5FC5;&#x987B;&#x80FD;&#x4F53;&#x73B0;&#x5177;&#x4F53;&#x670D;&#x52A1;&#x573A;&#x666F;</li>
<li>&#x6807;&#x9898;&#x4E0D;&#x80FD;&#x6D89;&#x53CA;&#x8425;&#x9500;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#xFF0C;&#x5305;&#x62EC;&#x4E0D;&#x9650;&#x4E8E;&#xFF1A;</li>
</ol>
</li>
<li>&#x5173;&#x952E;&#x8BCD;
<ol>
<li>&#x540C;&#x4E00;&#x6807;&#x9898;&#x4E0B;&#xFF0C;&#x5173;&#x952E;&#x8BCD;&#x4E0D;&#x80FD;&#x5B58;&#x5728;&#x76F8;&#x540C;</li>
<li>&#x540C;&#x4E00;&#x6807;&#x9898;&#x4E0B;&#xFF0C;&#x5173;&#x952E;&#x8BCD;&#x4E0D;&#x80FD;&#x5B58;&#x5728;&#x8FC7;&#x5EA6;&#x76F8;&#x4F3C;</li>
<li>&#x5173;&#x952E;&#x8BCD;&#x4E0D;&#x80FD;&#x5E26;&#x7279;&#x6B8A;&#x7B26;&#x53F7;&#x3001;&#x4E2A;&#x6027;&#x5316;&#x5B57;&#x8BCD;&#x7B49;&#x6CA1;&#x6709;&#x884C;&#x4E1A;&#x901A;&#x7528;&#x6027;&#x7684;&#x5185;&#x5BB9;</li>
<li>&#x5173;&#x952E;&#x8BCD;&#x5185;&#x5BB9;&#x793A;&#x4F8B;&#x5FC5;&#x987B;&#x4E0E;&#x5173;&#x952E;&#x8BCD;&#x5BF9;&#x5E94;&#x5339;&#x914D;</li>
<li>&#x5173;&#x952E;&#x8BCD;&#x4E0D;&#x80FD;&#x592A;&#x8FC7;&#x5BBD;&#x6CDB;&#xFF0C;&#x9700;&#x8981;&#x5177;&#x6709;&#x9650;&#x5236;&#x6027;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x201C;&#x5185;&#x5BB9;&#x201D;&#x8FD9;&#x4E2A;&#x5C31;&#x592A;&#x5BBD;&#x6CDB;&#xFF0C;&#x4E0D;&#x80FD;&#x5BA1;&#x6838;&#x901A;&#x8FC7;</li>
</ol>
</li>
</ol>
<p>&#x6D88;&#x8D39;&#x4F18;&#x60E0;&#x7C7B;&#x3001;&#x8D2D;&#x7269;&#x8FD4;&#x5229;&#x7C7B;&#x3001;&#x5546;&#x54C1;&#x66F4;&#x65B0;&#x7C7B;&#x3001;&#x4F18;&#x60E0;&#x5238;&#x7C7B;&#x3001;&#x4EE3;&#x91D1;&#x5238;&#x7C7B;&#x3001;&#x7EA2;&#x5305;&#x7C7B;&#x3001;&#x4F1A;&#x5458;&#x5361;&#x7C7B;&#x3001;&#x79EF;&#x5206;&#x7C7B;&#x3001;&#x6D3B;&#x52A8;&#x7C7B;&#x7B49;&#x8425;&#x9500;&#x503E;&#x5411;&#x901A;&#x77E5;</p>
<h3 id="&#x8FDD;&#x89C4;&#x8BF4;&#x660E;">&#x8FDD;&#x89C4;&#x8BF4;&#x660E;</h3>
<p>&#x9664;&#x4E0D;&#x80FD;&#x8FDD;&#x53CD;&#x8FD0;&#x8425;&#x89C4;&#x8303;&#x5916;&#xFF0C;&#x8FD8;&#x4E0D;&#x80FD;&#x8FDD;&#x53CD;&#x4EE5;&#x4E0B;&#x89C4;&#x5219;&#xFF0C;&#x5305;&#x62EC;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#xFF1A;</p>
<ol>
<li>&#x4E0D;&#x5141;&#x8BB8;&#x6076;&#x610F;&#x8BF1;&#x5BFC;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x89E6;&#x53D1;&#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x53EF;&#x5411;&#x7528;&#x6237;&#x4E0B;&#x53D1;&#x6A21;&#x677F;&#x76EE;&#x7684;</li>
<li>&#x4E0D;&#x5141;&#x8BB8;&#x6076;&#x610F;&#x9A9A;&#x6270;&#xFF0C;&#x4E0B;&#x53D1;&#x5BF9;&#x7528;&#x6237;&#x9020;&#x6210;&#x9A9A;&#x6270;&#x7684;&#x6A21;&#x677F;</li>
<li>&#x4E0D;&#x5141;&#x8BB8;&#x6076;&#x610F;&#x8425;&#x9500;&#xFF0C;&#x4E0B;&#x53D1;&#x8425;&#x9500;&#x76EE;&#x7684;&#x6A21;&#x677F;</li>
</ol>
<h3 id="&#x5904;&#x7F5A;&#x8BF4;&#x660E;">&#x5904;&#x7F5A;&#x8BF4;&#x660E;</h3>
<p>&#x6839;&#x636E;&#x8FDD;&#x89C4;&#x60C5;&#x51B5;&#x7ED9;&#x4E88;&#x76F8;&#x5E94;&#x68AF;&#x5EA6;&#x7684;&#x5904;&#x7F5A;&#xFF0C;&#x4E00;&#x822C;&#x5904;&#x7F5A;&#x89C4;&#x5219;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x7B2C;&#x4E00;&#x6B21;&#x8FDD;&#x89C4;&#xFF0C;&#x5220;&#x9664;&#x8FDD;&#x89C4;&#x6A21;&#x677F;&#x4EE5;&#x793A;&#x8B66;&#x544A;&#xFF0C;</li>
<li>&#x7B2C;&#x4E8C;&#x6B21;&#x8FDD;&#x89C4;&#xFF0C;&#x5C01;&#x7981;&#x63A5;&#x53E3;7&#x5929;&#xFF0C;</li>
<li>&#x7B2C;&#x4E09;&#x6B21;&#x8FDD;&#x89C4;&#xFF0C;&#x5C01;&#x7981;&#x63A5;&#x53E3;30&#x5929;&#xFF0C;</li>
<li>&#x7B2C;&#x56DB;&#x6B21;&#x8FDD;&#x89C4;&#xFF0C;&#x6C38;&#x4E45;&#x5C01;&#x7981;&#x63A5;&#x53E3;</li>
</ul>
<p>&#x5904;&#x7F5A;&#x7ED3;&#x679C;&#x53CA;&#x539F;&#x56E0;&#x4EE5;&#x7AD9;&#x5185;&#x4FE1;&#x5F62;&#x5F0F;&#x544A;&#x77E5;</p>

                            </section>
                        </div>
                        
                    </div>
                
</body>
</html>
