<!DOCTYPE html>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <title>消息推送</title>
  <link rel="stylesheet" href="../../../style.css" />
  <link rel="stylesheet" href="../../../website.css" />
  <style type="text/css">
    body {
      padding: 1em;
    }
  </style>
</head>
<body>
  
                    <div id="book-search-results">
                        <div class="search-noresults">
                            <section class="normal markdown-section">
                              <h2 id="&#x6D88;&#x606F;&#x63A8;&#x9001;">&#x6D88;&#x606F;&#x63A8;&#x9001;</h2>
<p>&#x63A5;&#x5165;&#x5FAE;&#x4FE1;&#x5C0F;&#x7A0B;&#x5E8F;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x670D;&#x52A1;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x9700;&#x8981;&#x6309;&#x7167;&#x5982;&#x4E0B;&#x6B65;&#x9AA4;&#x5B8C;&#x6210;&#xFF1A;</p>
<ol>
<li>&#x586B;&#x5199;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;</li>
<li>&#x9A8C;&#x8BC1;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x7684;&#x6709;&#x6548;&#x6027;</li>
<li>&#x636E;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x5B9E;&#x73B0;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF0C;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x548C;&#x4E8B;&#x4EF6;</li>
</ol>
<h3 id="&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x586B;&#x5199;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;">&#x7B2C;&#x4E00;&#x6B65;&#xFF1A;&#x586B;&#x5199;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;</h3>
<p>&#x767B;&#x5F55;<a href="https://mp.weixin.qq.com/" target="_blank">&#x5C0F;&#x7A0B;&#x5E8F;&#x540E;&#x53F0;</a>&#x540E;&#xFF0C;&#x5728;&#x300C;&#x5F00;&#x53D1;&#x300D;-&#x300C;&#x5F00;&#x53D1;&#x8BBE;&#x7F6E;&#x300D;-&#x300C;&#x6D88;&#x606F;&#x63A8;&#x9001;&#x300D;&#x4E2D;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x626B;&#x7801;&#x542F;&#x7528;&#x6D88;&#x606F;&#x670D;&#x52A1;&#xFF0C;&#x586B;&#x5199;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#xFF08;URL&#xFF09;&#x3001;&#x4EE4;&#x724C;&#xFF08;Token&#xFF09; &#x548C; &#x6D88;&#x606F;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#xFF08;EncodingAESKey&#xFF09;&#x7B49;&#x4FE1;&#x606F;&#x3002;</p>
<ul>
<li>URL: &#x5F00;&#x53D1;&#x8005;&#x7528;&#x6765;&#x63A5;&#x6536;&#x5FAE;&#x4FE1;&#x6D88;&#x606F;&#x548C;&#x4E8B;&#x4EF6;&#x7684;&#x63A5;&#x53E3; URL&#x3002;&#x5F00;&#x53D1;&#x8005;&#x6240;&#x586B;&#x5199;&#x7684;URL &#x5FC5;&#x987B;&#x4EE5; http:// &#x6216; https:// &#x5F00;&#x5934;&#xFF0C;&#x5206;&#x522B;&#x652F;&#x6301; 80 &#x7AEF;&#x53E3;&#x548C; 443 &#x7AEF;&#x53E3;&#x3002;</li>
<li>Token: &#x53EF;&#x7531;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x586B;&#x5199;&#xFF0C;&#x7528;&#x4F5C;&#x751F;&#x6210;&#x7B7E;&#x540D;&#xFF08;&#x8BE5; Token &#x4F1A;&#x548C;&#x63A5;&#x53E3; URL &#x4E2D;&#x5305;&#x542B;&#x7684; Token &#x8FDB;&#x884C;&#x6BD4;&#x5BF9;&#xFF0C;&#x4ECE;&#x800C;&#x9A8C;&#x8BC1;&#x5B89;&#x5168;&#x6027;&#xFF09;&#x3002;</li>
<li>EncodingAESKey: &#x7531;&#x5F00;&#x53D1;&#x8005;&#x624B;&#x52A8;&#x586B;&#x5199;&#x6216;&#x968F;&#x673A;&#x751F;&#x6210;&#xFF0C;&#x5C06;&#x7528;&#x4F5C;&#x6D88;&#x606F;&#x4F53;&#x52A0;&#x89E3;&#x5BC6;&#x5BC6;&#x94A5;&#x3002;</li>
</ul>
<p>&#x540C;&#x65F6;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x9009;&#x62E9;&#x6D88;&#x606F;&#x52A0;&#x89E3;&#x5BC6;&#x65B9;&#x5F0F;&#xFF1A;&#x660E;&#x6587;&#x6A21;&#x5F0F;&#xFF08;&#x9ED8;&#x8BA4;&#xFF09;&#x3001;&#x517C;&#x5BB9;&#x6A21;&#x5F0F;&#x548C;&#x5B89;&#x5168;&#x6A21;&#x5F0F;&#x3002;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6D88;&#x606F;&#x6570;&#x636E;&#x683C;&#x5F0F;&#xFF1A;XML &#x683C;&#x5F0F;&#xFF08;&#x9ED8;&#x8BA4;&#xFF09;&#x6216; JSON &#x683C;&#x5F0F;&#x3002;</p>
<p><img src="https://developers.weixin.qq.com/miniprogram/dev/framework/server-ability/image/callback_help.png?t=19012314" alt="&#x586B;&#x5199;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;" onerror="this.src !== &apos;./image/callback_help.png?t=19012314&apos; &amp;&amp; (this.src = &apos;./image/callback_help.png?t=19012314&apos;)"></p>
<p>&#x6A21;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#x4E0E;&#x670D;&#x52A1;&#x5668;&#x914D;&#x7F6E;&#x5728;&#x63D0;&#x4EA4;&#x540E;&#x90FD;&#x4F1A;&#x7ACB;&#x5373;&#x751F;&#x6548;&#xFF0C;&#x8BF7;&#x5F00;&#x53D1;&#x8005;&#x8C28;&#x614E;&#x586B;&#x5199;&#x53CA;&#x9009;&#x62E9;&#x3002;&#x5207;&#x6362;&#x52A0;&#x5BC6;&#x65B9;&#x5F0F;&#x548C;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x9700;&#x8981;&#x63D0;&#x524D;&#x914D;&#x7F6E;&#x597D;&#x76F8;&#x5173;&#x4EE3;&#x7801;&#xFF0C;&#x8BE6;&#x60C5;&#x8BF7;&#x53C2;&#x8003; <a href="https://open.weixin.qq.com/cgi-bin/showdocument?action=dir_list&amp;t=resource/res_list&amp;verify=1&amp;id=open1419318479&amp;token=&amp;lang=zh_CN" target="_blank">&#x6D88;&#x606F;&#x52A0;&#x89E3;&#x5BC6;&#x8BF4;&#x660E;</a>&#x3002;</p>
<h3 id="&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x9A8C;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x786E;&#x6765;&#x81EA;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;">&#x7B2C;&#x4E8C;&#x6B65;&#xFF1A;&#x9A8C;&#x8BC1;&#x6D88;&#x606F;&#x7684;&#x786E;&#x6765;&#x81EA;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;</h3>
<p>&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4EA4;&#x4FE1;&#x606F;&#x540E;&#xFF0C;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#x5C06;&#x53D1;&#x9001;GET&#x8BF7;&#x6C42;&#x5230;&#x586B;&#x5199;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;URL&#x4E0A;&#xFF0C;GET&#x8BF7;&#x6C42;&#x643A;&#x5E26;&#x53C2;&#x6570;&#x5982;&#x4E0B;&#x8868;&#x6240;&#x793A;&#xFF1A;</p>
<table>
<thead>
<tr>
<th>&#x53C2;&#x6570;</th>
<th>&#x63CF;&#x8FF0;</th>
</tr>
</thead>
<tbody>
<tr>
<td>signature</td>
<td>&#x5FAE;&#x4FE1;&#x52A0;&#x5BC6;&#x7B7E;&#x540D;&#xFF0C;signature&#x7ED3;&#x5408;&#x4E86;&#x5F00;&#x53D1;&#x8005;&#x586B;&#x5199;&#x7684;token&#x53C2;&#x6570;&#x548C;&#x8BF7;&#x6C42;&#x4E2D;&#x7684;timestamp&#x53C2;&#x6570;&#x3001;nonce&#x53C2;&#x6570;&#x3002;</td>
</tr>
<tr>
<td>timestamp</td>
<td>&#x65F6;&#x95F4;&#x6233;</td>
</tr>
<tr>
<td>nonce</td>
<td>&#x968F;&#x673A;&#x6570;</td>
</tr>
<tr>
<td>echostr</td>
<td>&#x968F;&#x673A;&#x5B57;&#x7B26;&#x4E32;</td>
</tr>
</tbody>
</table>
<p>&#x5F00;&#x53D1;&#x8005;&#x901A;&#x8FC7;&#x68C0;&#x9A8C; signature &#x5BF9;&#x8BF7;&#x6C42;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF08;&#x4E0B;&#x9762;&#x6709;&#x6821;&#x9A8C;&#x65B9;&#x5F0F;&#xFF09;&#x3002;&#x82E5;&#x786E;&#x8BA4;&#x6B64;&#x6B21; GET &#x8BF7;&#x6C42;&#x6765;&#x81EA;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8BF7;&#x539F;&#x6837;&#x8FD4;&#x56DE; echostr &#x53C2;&#x6570;&#x5185;&#x5BB9;&#xFF0C;&#x5219;&#x63A5;&#x5165;&#x751F;&#x6548;&#xFF0C;&#x6210;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x6210;&#x529F;&#xFF0C;&#x5426;&#x5219;&#x63A5;&#x5165;&#x5931;&#x8D25;&#x3002;&#x52A0;&#x5BC6;/&#x6821;&#x9A8C;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x5C06;token&#x3001;timestamp&#x3001;nonce&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x5B57;&#x5178;&#x5E8F;&#x6392;&#x5E8F;</li>
<li>&#x5C06;&#x4E09;&#x4E2A;&#x53C2;&#x6570;&#x5B57;&#x7B26;&#x4E32;&#x62FC;&#x63A5;&#x6210;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;sha1&#x52A0;&#x5BC6;</li>
<li>&#x5F00;&#x53D1;&#x8005;&#x83B7;&#x5F97;&#x52A0;&#x5BC6;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4E0E;signature&#x5BF9;&#x6BD4;&#xFF0C;&#x6807;&#x8BC6;&#x8BE5;&#x8BF7;&#x6C42;&#x6765;&#x6E90;&#x4E8E;&#x5FAE;&#x4FE1;</li>
</ol>
<p>&#x9A8C;&#x8BC1;URL&#x6709;&#x6548;&#x6027;&#x6210;&#x529F;&#x540E;&#x5373;&#x63A5;&#x5165;&#x751F;&#x6548;&#xFF0C;&#x6210;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x3002;</p>
<p>&#x68C0;&#x9A8C;signature&#x7684;PHP&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code class="language-php"><span class="hljs-keyword">private</span> <span class="hljs-function"><span class="hljs-keyword">function</span> <span class="hljs-title">checkSignature</span><span class="hljs-params">()</span>
</span>{
    $signature = $_GET[<span class="hljs-string">&quot;signature&quot;</span>];
    $timestamp = $_GET[<span class="hljs-string">&quot;timestamp&quot;</span>];
    $nonce = $_GET[<span class="hljs-string">&quot;nonce&quot;</span>];

    $token = TOKEN;
    $tmpArr = <span class="hljs-keyword">array</span>($token, $timestamp, $nonce);
    sort($tmpArr, SORT_STRING);
    $tmpStr = implode( $tmpArr );
    $tmpStr = sha1( $tmpStr );

    <span class="hljs-keyword">if</span> ($tmpStr == $signature ) {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">true</span>;
    } <span class="hljs-keyword">else</span> {
        <span class="hljs-keyword">return</span> <span class="hljs-keyword">false</span>;
    }
}

</code></pre>
<p>PHP&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E0B;&#x8F7D;&#xFF1A;<a href="https://wximg.gtimg.com/shake_tv/mpwiki/cryptoDemo.zip" target="_blank">&#x4E0B;&#x8F7D;</a></p>
<h3 id="&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x548C;&#x4E8B;&#x4EF6;">&#x7B2C;&#x4E09;&#x6B65;&#xFF1A;&#x63A5;&#x6536;&#x6D88;&#x606F;&#x548C;&#x4E8B;&#x4EF6;</h3>
<p>&#x5F53;&#x67D0;&#x4E9B;&#x7279;&#x5B9A;&#x7684;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x5F15;&#x53D1;&#x4E8B;&#x4EF6;&#x63A8;&#x9001;&#x65F6;&#xFF08;&#x5982;&#x7528;&#x6237;&#x5411;&#x5C0F;&#x7A0B;&#x5E8F;&#x5BA2;&#x670D;&#x53D1;&#x9001;&#x6D88;&#x606F;&#x3001;&#x6216;&#x8005;&#x8FDB;&#x5165;&#x4F1A;&#x8BDD;&#x7B49;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x5C06;&#x6D88;&#x606F;&#xFF08;&#x6216;&#x4E8B;&#x4EF6;&#xFF09;&#x7684;&#x6570;&#x636E;&#x5305;&#x4EE5; POST &#x8BF7;&#x6C42;&#x53D1;&#x9001;&#x5230;&#x5F00;&#x53D1;&#x8005;&#x914D;&#x7F6E;&#x7684; URL&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x4F9D;&#x636E;&#x81EA;&#x8EAB;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x8FDB;&#x884C;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#x5728;&#x5C06;&#x7528;&#x6237;&#x7684;&#x6D88;&#x606F;&#x53D1;&#x7ED9;&#x5F00;&#x53D1;&#x8005;&#x670D;&#x52A1;&#x5668;&#x5730;&#x5740;&#x540E;&#xFF0C;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#x5728;&#x4E94;&#x79D2;&#x5185;&#x6536;&#x4E0D;&#x5230;&#x54CD;&#x5E94;&#x4F1A;&#x65AD;&#x6389;&#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x4E14;&#x91CD;&#x65B0;&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF0C;&#x603B;&#x5171;&#x91CD;&#x8BD5;&#x4E09;&#x6B21;&#x3002;&#x5982;&#x679C;&#x5728;&#x8C03;&#x8BD5;&#x4E2D;&#xFF0C;&#x53D1;&#x73B0;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x6536;&#x5230;&#x54CD;&#x5E94;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x6D88;&#x606F;&#x5904;&#x7406;&#x8D85;&#x65F6;&#x3002;&#x5173;&#x4E8E;&#x91CD;&#x8BD5;&#x7684;&#x6D88;&#x606F;&#x6392;&#x91CD;&#xFF0C;&#x6709; msgid &#x7684;&#x6D88;&#x606F;&#x63A8;&#x8350;&#x4F7F;&#x7528; msgid &#x6392;&#x91CD;&#x3002;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#x6D88;&#x606F;&#x63A8;&#x8350;&#x4F7F;&#x7528; FromUserName + CreateTime &#x6392;&#x91CD;&#x3002;</p>
<p>&#x670D;&#x52A1;&#x5668;&#x6536;&#x5230;&#x8BF7;&#x6C42;&#x5FC5;&#x987B;&#x505A;&#x51FA;&#x4E0B;&#x8FF0;&#x56DE;&#x590D;&#xFF0C;&#x8FD9;&#x6837;&#x5FAE;&#x4FE1;&#x670D;&#x52A1;&#x5668;&#x624D;&#x4E0D;&#x4F1A;&#x5BF9;&#x6B64;&#x4F5C;&#x4EFB;&#x4F55;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x53D1;&#x8D77;&#x91CD;&#x8BD5;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x5C06;&#x51FA;&#x73B0;&#x4E25;&#x91CD;&#x7684;&#x9519;&#x8BEF;&#x63D0;&#x793A;&#x3002;&#x8BE6;&#x89C1;&#x4E0B;&#x9762;&#x8BF4;&#x660E;&#xFF1A;</p>
<ol>
<li>&#x76F4;&#x63A5;&#x56DE;&#x590D;success&#xFF08;&#x63A8;&#x8350;&#x65B9;&#x5F0F;&#xFF09;</li>
<li>&#x76F4;&#x63A5;&#x56DE;&#x590D;&#x7A7A;&#x4E32;&#xFF08;&#x6307;&#x5B57;&#x8282;&#x957F;&#x5EA6;&#x4E3A;0&#x7684;&#x7A7A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7ED3;&#x6784;&#x4F53;&#x4E2D;content&#x5B57;&#x6BB5;&#x7684;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#xFF09;</li>
<li>&#x82E5;&#x63A5;&#x53E3;&#x6587;&#x6863;&#x6709;&#x6307;&#x5B9A;&#x8FD4;&#x56DE;&#x5185;&#x5BB9;&#xFF0C;&#x5E94;&#x6309;&#x6587;&#x6863;&#x8BF4;&#x660E;&#x8FD4;&#x56DE;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x5BA2;&#x670D;&#x6D88;&#x606F;&#xFF0C;&#x4E00;&#x65E6;&#x9047;&#x5230;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#xFF0C;&#x5FAE;&#x4FE1;&#x4F1A;&#x5728;&#x5C0F;&#x7A0B;&#x5E8F;&#x4F1A;&#x8BDD;&#x4E2D;&#x5411;&#x7528;&#x6237;&#x4E0B;&#x53D1;&#x7CFB;&#x7EDF;&#x63D0;&#x793A;&#x201C;&#x8BE5;&#x5C0F;&#x7A0B;&#x5E8F;&#x5BA2;&#x670D;&#x6682;&#x65F6;&#x65E0;&#x6CD5;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x8BF7;&#x7A0D;&#x540E;&#x518D;&#x8BD5;&#x201D;&#xFF1A;</p>
<ol>
<li>&#x5F00;&#x53D1;&#x8005;&#x5728;5&#x79D2;&#x5185;&#x672A;&#x56DE;&#x590D;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;</li>
<li>&#x5F00;&#x53D1;&#x8005;&#x56DE;&#x590D;&#x4E86;&#x5F02;&#x5E38;&#x6570;&#x636E;</li>
</ol>
<p>&#x5982;&#x679C;&#x5F00;&#x53D1;&#x8005;&#x5E0C;&#x671B;&#x589E;&#x5F3A;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5F00;&#x53D1;&#x8005;&#x4E2D;&#x5FC3;&#x5904;&#x5F00;&#x542F;&#x6D88;&#x606F;&#x52A0;&#x5BC6;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x7528;&#x6237;&#x53D1;&#x7ED9;&#x5C0F;&#x7A0B;&#x5E8F;&#x7684;&#x6D88;&#x606F;&#x4EE5;&#x53CA;&#x5C0F;&#x7A0B;&#x5E8F;&#x88AB;&#x52A8;&#x56DE;&#x590D;&#x7528;&#x6237;&#x6D88;&#x606F;&#x90FD;&#x4F1A;&#x7EE7;&#x7EED;&#x52A0;&#x5BC6;&#xFF0C;&#x8BE6;&#x89C1;<a href="https://open.weixin.qq.com/cgi-bin/showdocument?action=dir_list&amp;t=resource/res_list&amp;verify=1&amp;id=open1419318479&amp;token=&amp;lang=zh_CN" target="_blank">&#x6D88;&#x606F;&#x52A0;&#x89E3;&#x5BC6;&#x8BF4;&#x660E;</a>&#x3002;</p>

                            </section>
                        </div>
                        
                    </div>
                
</body>
</html>
